[
  {
    "id": "entity_movie_0",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Captain America: The Winter Soldier",
    "text": "Captain America: The Winter Soldier (2014). is a Action, Adventure, ScienceFiction movie. Plot: After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adju.... Budget: $170M, Revenue: $715M, Rating: 7.6/10. Part of Captain America Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/100402",
      "title": "Captain America: The Winter Soldier",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
      "budget": 170000000.0,
      "release_date": "2014-03-20",
      "rating": 7.6,
      "revenue": 714766572.0,
      "cast": [],
      "collection": "Captain America Collection"
    }
  },
  {
    "id": "entity_movie_1",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Leon: The Professional",
    "text": "Leon: The Professional (1994). is a Crime, Drama, Thriller movie. Plot: Leon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA ag.... Budget: $16M, Revenue: $45M, Rating: 8.2/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/101",
      "title": "Leon: The Professional",
      "genres": [
        "Crime",
        "Drama",
        "Thriller"
      ],
      "plot": "Leon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Leon's footsteps.",
      "budget": 16000000.0,
      "release_date": "1994-09-14",
      "rating": 8.2,
      "revenue": 45284974.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_2",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hunger Games: Catching Fire",
    "text": "The Hunger Games: Catching Fire (2013). is a Action, Adventure, ScienceFiction movie. Plot: Katniss Everdeen has returned home safe after winning the 74th Annual Hunger Games along with fellow tribute Peeta Mellark. Winning means that they mu.... Budget: $130M, Revenue: $847M, Rating: 7.4/10. Part of The Hunger Games Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/101299",
      "title": "The Hunger Games: Catching Fire",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Katniss Everdeen has returned home safe after winning the 74th Annual Hunger Games along with fellow tribute Peeta Mellark. Winning means that they must turn around and leave their family and close friends, embarking on a \"Victor's Tour\" of the districts. Along the way Katniss senses that a rebellion is simmering, but the Capitol is still very much in control as President Snow prepares the 75th Annual Hunger Games (The Quarter Quell) - a competition that could change Panem forever.",
      "budget": 130000000.0,
      "release_date": "2013-11-15",
      "rating": 7.4,
      "revenue": 847423452.0,
      "cast": [],
      "collection": "The Hunger Games Collection"
    }
  },
  {
    "id": "entity_movie_3",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Iron Man 2",
    "text": "Iron Man 2 (2010). is a Action, Adventure, ScienceFiction movie. Plot: With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the p.... Budget: $200M, Revenue: $624M, Rating: 6.6/10. Part of Iron Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/10138",
      "title": "Iron Man 2",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies.",
      "budget": 200000000.0,
      "release_date": "2010-04-28",
      "rating": 6.6,
      "revenue": 623933331.0,
      "cast": [],
      "collection": "Iron Man Collection"
    }
  },
  {
    "id": "entity_movie_4",
    "type": "entity",
    "entity_type": "Movie",
    "title": "How to Train Your Dragon",
    "text": "How to Train Your Dragon (2010). is a Adventure, Animation, Family movie. Plot: As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his wa.... Budget: $165M, Revenue: $495M, Rating: 7.5/10. Part of How to Train Your Dragon Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/10191",
      "title": "How to Train Your Dragon",
      "genres": [
        "Adventure",
        "Animation",
        "Family",
        "Fantasy"
      ],
      "plot": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father",
      "budget": 165000000.0,
      "release_date": "2010-03-05",
      "rating": 7.5,
      "revenue": 494878759.0,
      "cast": [],
      "collection": "How to Train Your Dragon Collection"
    }
  },
  {
    "id": "entity_movie_5",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Toy Story 3",
    "text": "Toy Story 3 (2010). is a Animation, Comedy, Family movie. Plot: Woody, Buzz, and the rest of Andy's toys haven't been played with in years. With Andy about to go to college, the gang find themselves accidentally le.... Budget: $200M, Revenue: $1067M, Rating: 7.6/10. Part of Toy Story Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/10193",
      "title": "Toy Story 3",
      "genres": [
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Woody, Buzz, and the rest of Andy's toys haven't been played with in years. With Andy about to go to college, the gang find themselves accidentally left at a nefarious day care center. The toys must band together to escape and return home to Andy.",
      "budget": 200000000.0,
      "release_date": "2010-06-16",
      "rating": 7.6,
      "revenue": 1066969703.0,
      "cast": [],
      "collection": "Toy Story Collection"
    }
  },
  {
    "id": "entity_movie_6",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Thor",
    "text": "Thor (2011). is a Action, Adventure, Fantasy movie. Plot: Against his father Odin's will, The Mighty Thor - a powerful but arrogant warrior god - recklessly reignites an ancient war. Thor is cast down to Eart.... Budget: $150M, Revenue: $449M, Rating: 6.6/10. Part of Thor Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/10195",
      "title": "Thor",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Against his father Odin's will, The Mighty Thor - a powerful but arrogant warrior god - recklessly reignites an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth.",
      "budget": 150000000.0,
      "release_date": "2011-04-21",
      "rating": 6.6,
      "revenue": 449326618.0,
      "cast": [],
      "collection": "Thor Collection"
    }
  },
  {
    "id": "entity_movie_7",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Amazing Spider-Man 2",
    "text": "The Amazing Spider-Man 2 (2014). is a Action, Adventure, Fantasy movie. Plot: For Peter Parker, life is busy. Between taking out the bad guys as Spider-Man and spending time with the person he loves, Gwen Stacy, high school grad.... Budget: $200M, Revenue: $706M, Rating: 6.5/10. Part of The Amazing Spider-Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/102382",
      "title": "The Amazing Spider-Man 2",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "For Peter Parker, life is busy. Between taking out the bad guys as Spider-Man and spending time with the person he loves, Gwen Stacy, high school graduation cannot come quickly enough. Peter has not forgotten about the promise he made to Gwen’s father to protect her by staying away, but that is a promise he cannot keep. Things will change for Peter when a new villain, Electro, emerges, an old friend, Harry Osborn, returns, and Peter uncovers new clues about his past.",
      "budget": 200000000.0,
      "release_date": "2014-04-16",
      "rating": 6.5,
      "revenue": 705717432.0,
      "cast": [],
      "collection": "The Amazing Spider-Man Collection"
    }
  },
  {
    "id": "entity_movie_8",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Maleficent",
    "text": "Maleficent (2014). is a Action, Adventure, Family movie. Plot: The untold story of Disney's most iconic villain from the 1959 classic 'Sleeping Beauty'. A beautiful, pure-hearted young woman, Maleficent has an idy.... Budget: $180M, Revenue: $759M, Rating: 7.0/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/102651",
      "title": "Maleficent",
      "genres": [
        "Action",
        "Adventure",
        "Family",
        "Fantasy",
        "Romance"
      ],
      "plot": "The untold story of Disney's most iconic villain from the 1959 classic 'Sleeping Beauty'. A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land.  Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and to Maleficent's true happiness as well.",
      "budget": 180000000.0,
      "release_date": "2014-05-28",
      "rating": 7.0,
      "revenue": 758539785.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_9",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Ant-Man",
    "text": "Ant-Man (2015). is a Action, Adventure, ScienceFiction movie. Plot: Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mento.... Budget: $130M, Revenue: $519M, Rating: 7.0/10. Part of Ant-Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/102899",
      "title": "Ant-Man",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
      "budget": 130000000.0,
      "release_date": "2015-07-14",
      "rating": 7.0,
      "revenue": 519311965.0,
      "cast": [],
      "collection": "Ant-Man Collection"
    }
  },
  {
    "id": "entity_movie_10",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Back to the Future",
    "text": "Back to the Future (1985). is a Adventure, Comedy, Family movie. Plot: Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother.... Budget: $19M, Revenue: $381M, Rating: 8.0/10. Part of Back to the Future Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/105",
      "title": "Back to the Future",
      "genres": [
        "Adventure",
        "Comedy",
        "Family",
        "ScienceFiction"
      ],
      "plot": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
      "budget": 19000000.0,
      "release_date": "1985-07-03",
      "rating": 8.0,
      "revenue": 381109762.0,
      "cast": [],
      "collection": "Back to the Future Collection"
    }
  },
  {
    "id": "entity_movie_11",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Sherlock Holmes",
    "text": "Sherlock Holmes (2009). is a Action, Adventure, Crime movie. Plot: Eccentric consulting detective, Sherlock Holmes and Doctor John Watson battle to bring down a new nemesis and unravel a deadly plot that could destroy.... Budget: $90M, Revenue: $524M, Rating: 7.0/10. Part of Sherlock Holmes Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/10528",
      "title": "Sherlock Holmes",
      "genres": [
        "Action",
        "Adventure",
        "Crime",
        "Mystery"
      ],
      "plot": "Eccentric consulting detective, Sherlock Holmes and Doctor John Watson battle to bring down a new nemesis and unravel a deadly plot that could destroy England.",
      "budget": 90000000.0,
      "release_date": "2009-12-23",
      "rating": 7.0,
      "revenue": 524028679.0,
      "cast": [],
      "collection": "Sherlock Holmes Collection"
    }
  },
  {
    "id": "entity_movie_12",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Wolf of Wall Street",
    "text": "The Wolf of Wall Street (2013). is a Comedy, Crime, Drama movie. Plot: A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infi.... Budget: $100M, Revenue: $392M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/106646",
      "title": "The Wolf of Wall Street",
      "genres": [
        "Comedy",
        "Crime",
        "Drama"
      ],
      "plot": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
      "budget": 100000000.0,
      "release_date": "2013-12-25",
      "rating": 7.9,
      "revenue": 392000694.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_13",
    "type": "entity",
    "entity_type": "Movie",
    "title": "WALL·E",
    "text": "WALL·E (2008). is a Animation, Family movie. Plot: WALL·E is the last robot left on an Earth that has been overrun with garbage and all humans have fled to outer space. For 700 years he has continued t.... Budget: $180M, Revenue: $521M, Rating: 7.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/10681",
      "title": "WALL·E",
      "genres": [
        "Animation",
        "Family"
      ],
      "plot": "WALL·E is the last robot left on an Earth that has been overrun with garbage and all humans have fled to outer space. For 700 years he has continued to try and clean up the mess, but has developed some rather interesting human-like qualities. When a ship arrives with a sleek new type of robot, WALL·E thinks he's finally found a friend and stows away on the ship when it leaves.",
      "budget": 180000000.0,
      "release_date": "2008-06-22",
      "rating": 7.8,
      "revenue": 521311860.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_14",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Frozen",
    "text": "Frozen (2013). is a Adventure, Animation, Family movie. Plot: Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt t.... Budget: $150M, Revenue: $1274M, Rating: 7.3/10. Part of Frozen Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/109445",
      "title": "Frozen",
      "genres": [
        "Adventure",
        "Animation",
        "Family"
      ],
      "plot": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
      "budget": 150000000.0,
      "release_date": "2013-11-27",
      "rating": 7.3,
      "revenue": 1274219009.0,
      "cast": [],
      "collection": "Frozen Collection"
    }
  },
  {
    "id": "entity_movie_15",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Wars",
    "text": "Star Wars (1977). is a Action, Adventure, ScienceFiction movie. Plot: Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker an.... Budget: $11M, Revenue: $775M, Rating: 8.1/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/11",
      "title": "Star Wars",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
      "budget": 11000000.0,
      "release_date": "1977-05-25",
      "rating": 8.1,
      "revenue": 775398007.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_16",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Prestige",
    "text": "The Prestige (2006). is a Drama, Mystery, Thriller movie. Plot: A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy wit.... Budget: $40M, Revenue: $110M, Rating: 8.0/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1124",
      "title": "The Prestige",
      "genres": [
        "Drama",
        "Mystery",
        "Thriller"
      ],
      "plot": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
      "budget": 40000000.0,
      "release_date": "2006-10-19",
      "rating": 8.0,
      "revenue": 109676311.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_17",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Shutter Island",
    "text": "Shutter Island (2010). is a Drama, Mystery, Thriller movie. Plot: World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his .... Budget: $80M, Revenue: $295M, Rating: 7.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/11324",
      "title": "Shutter Island",
      "genres": [
        "Drama",
        "Mystery",
        "Thriller"
      ],
      "plot": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by his troubling visions and also by a mysterious doctor.",
      "budget": 80000000.0,
      "release_date": "2010-02-18",
      "rating": 7.8,
      "revenue": 294804195.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_18",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Guardians of the Galaxy",
    "text": "Guardians of the Galaxy (2014). is a Action, Adventure, ScienceFiction movie. Plot: Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Rona.... Budget: $170M, Revenue: $773M, Rating: 7.9/10. Part of Guardians of the Galaxy Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/118340",
      "title": "Guardians of the Galaxy",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
      "budget": 170000000.0,
      "release_date": "2014-07-30",
      "rating": 7.9,
      "revenue": 773328629.0,
      "cast": [],
      "collection": "Guardians of the Galaxy Collection"
    }
  },
  {
    "id": "entity_movie_19",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Dawn of the Planet of the Apes",
    "text": "Dawn of the Planet of the Apes (2014). is a Action, Drama, ScienceFiction movie. Plot: A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain.... Budget: $170M, Revenue: $711M, Rating: 7.3/10. Part of Planet of the Apes (Reboot) Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/119450",
      "title": "Dawn of the Planet of the Apes",
      "genres": [
        "Action",
        "Drama",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
      "budget": 170000000.0,
      "release_date": "2014-06-26",
      "rating": 7.3,
      "revenue": 710644566.0,
      "cast": [],
      "collection": "Planet of the Apes (Reboot) Collection"
    }
  },
  {
    "id": "entity_movie_20",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Finding Nemo",
    "text": "Finding Nemo (2003). is a Animation, Family movie. Plot: Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome .... Budget: $94M, Revenue: $940M, Rating: 7.6/10. Part of Finding Nemo Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/12",
      "title": "Finding Nemo",
      "genres": [
        "Animation",
        "Family"
      ],
      "plot": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
      "budget": 94000000.0,
      "release_date": "2003-05-30",
      "rating": 7.6,
      "revenue": 940335536.0,
      "cast": [],
      "collection": "Finding Nemo Collection"
    }
  },
  {
    "id": "entity_movie_21",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "text": "The Lord of the Rings: The Fellowship of the Ring (2001). is a Action, Adventure, Fantasy movie. Plot: Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the han.... Budget: $93M, Revenue: $871M, Rating: 8.0/10. Part of The Lord of the Rings Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/120",
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
      "budget": 93000000.0,
      "release_date": "2001-12-18",
      "rating": 8.0,
      "revenue": 871368364.0,
      "cast": [],
      "collection": "The Lord of the Rings Collection"
    }
  },
  {
    "id": "entity_movie_22",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Grand Budapest Hotel",
    "text": "The Grand Budapest Hotel (2014). is a Comedy, Drama movie. Plot: The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becom.... Budget: $30M, Revenue: $175M, Rating: 8.0/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/120467",
      "title": "The Grand Budapest Hotel",
      "genres": [
        "Comedy",
        "Drama"
      ],
      "plot": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
      "budget": 30000000.0,
      "release_date": "2014-02-26",
      "rating": 8.0,
      "revenue": 174600318.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_23",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Lord of the Rings: The Two Towers",
    "text": "The Lord of the Rings: The Two Towers (2002). is a Action, Adventure, Fantasy movie. Plot: Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. A.... Budget: $79M, Revenue: $926M, Rating: 8.0/10. Part of The Lord of the Rings Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/121",
      "title": "The Lord of the Rings: The Two Towers",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
      "budget": 79000000.0,
      "release_date": "2002-12-18",
      "rating": 8.0,
      "revenue": 926287400.0,
      "cast": [],
      "collection": "The Lord of the Rings Collection"
    }
  },
  {
    "id": "entity_movie_24",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Alice in Wonderland",
    "text": "Alice in Wonderland (2010). is a Adventure, Family, Fantasy movie. Plot: Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to .... Budget: $200M, Revenue: $1025M, Rating: 6.4/10. Part of Alice in Wonderland Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/12155",
      "title": "Alice in Wonderland",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called 'Underland,' she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason – to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
      "budget": 200000000.0,
      "release_date": "2010-03-03",
      "rating": 6.4,
      "revenue": 1025491110.0,
      "cast": [],
      "collection": "Alice in Wonderland Collection"
    }
  },
  {
    "id": "entity_movie_25",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Lord of the Rings: The Return of the King",
    "text": "The Lord of the Rings: The Return of the King (2003). is a Action, Adventure, Fantasy movie. Plot: Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron.... Budget: $94M, Revenue: $1119M, Rating: 8.1/10. Part of The Lord of the Rings Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/122",
      "title": "The Lord of the Rings: The Return of the King",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam bring the ring closer to the heart of Mordor, the dark lord's realm.",
      "budget": 94000000.0,
      "release_date": "2003-12-01",
      "rating": 8.1,
      "revenue": 1118888979.0,
      "cast": [],
      "collection": "The Lord of the Rings Collection"
    }
  },
  {
    "id": "entity_movie_26",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hobbit: The Battle of the Five Armies",
    "text": "The Hobbit: The Battle of the Five Armies (2014). is a Action, Adventure, Fantasy movie. Plot: Immediately after the events of The Desolation of Smaug, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: t.... Budget: $250M, Revenue: $956M, Rating: 7.1/10. Part of The Hobbit Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/122917",
      "title": "The Hobbit: The Battle of the Five Armies",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Immediately after the events of The Desolation of Smaug, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands.",
      "budget": 250000000.0,
      "release_date": "2014-12-10",
      "rating": 7.1,
      "revenue": 956019788.0,
      "cast": [],
      "collection": "The Hobbit Collection"
    }
  },
  {
    "id": "entity_movie_27",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Deathly Hallows: Part 1",
    "text": "Harry Potter and the Deathly Hallows: Part 1 (2010). is a Adventure, Family, Fantasy movie. Plot: Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for .... Budget: $250M, Revenue: $954M, Rating: 7.5/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/12444",
      "title": "Harry Potter and the Deathly Hallows: Part 1",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
      "budget": 250000000.0,
      "release_date": "2010-10-17",
      "rating": 7.5,
      "revenue": 954305868.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_28",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Deathly Hallows: Part 2",
    "text": "Harry Potter and the Deathly Hallows: Part 2 (2011). is a Adventure, Family, Fantasy movie. Plot: Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wiza.... Budget: $125M, Revenue: $1342M, Rating: 7.9/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/12445",
      "title": "Harry Potter and the Deathly Hallows: Part 2",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.",
      "budget": 125000000.0,
      "release_date": "2011-07-07",
      "rating": 7.9,
      "revenue": 1342000000.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_29",
    "type": "entity",
    "entity_type": "Movie",
    "title": "300",
    "text": "300 (2006). is a Action, Adventure, War movie. Plot: Based on Frank Miller's graphic novel, \"300\" is very loosely based the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against t.... Budget: $65M, Revenue: $423M, Rating: 7.0/10. Part of 300 Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1271",
      "title": "300",
      "genres": [
        "Action",
        "Adventure",
        "War"
      ],
      "plot": "Based on Frank Miller's graphic novel, \"300\" is very loosely based the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against the advancing Persians; the battle is said to have inspired all of Greece to band together against the Persians, and helped usher in the world's first democracy.",
      "budget": 65000000.0,
      "release_date": "2006-12-09",
      "rating": 7.0,
      "revenue": 422610419.0,
      "cast": [],
      "collection": "300 Collection"
    }
  },
  {
    "id": "entity_movie_30",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Finding Dory",
    "text": "Finding Dory (2016). is a Adventure, Animation, Comedy movie. Plot: Dory is reunited with her friends Nemo and Marlin in the search for answers about her past. What can she remember? Who are her parents? And where did .... Budget: $200M, Revenue: $1029M, Rating: 6.8/10. Part of Finding Nemo Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/127380",
      "title": "Finding Dory",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Dory is reunited with her friends Nemo and Marlin in the search for answers about her past. What can she remember? Who are her parents? And where did she learn to speak Whale?",
      "budget": 200000000.0,
      "release_date": "2016-06-16",
      "rating": 6.8,
      "revenue": 1028570889.0,
      "cast": [],
      "collection": "Finding Nemo Collection"
    }
  },
  {
    "id": "entity_movie_31",
    "type": "entity",
    "entity_type": "Movie",
    "title": "X-Men: Days of Future Past",
    "text": "X-Men: Days of Future Past (2014). is a Action, Adventure, Fantasy movie. Plot: The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an e.... Budget: $250M, Revenue: $748M, Rating: 7.5/10. Part of X-Men Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/127585",
      "title": "X-Men: Days of Future Past",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.",
      "budget": 250000000.0,
      "release_date": "2014-05-15",
      "rating": 7.5,
      "revenue": 747862775.0,
      "cast": [],
      "collection": "X-Men Collection"
    }
  },
  {
    "id": "entity_movie_32",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Spirited Away",
    "text": "Spirited Away (2001). is a Adventure, Animation, Family movie. Plot: A ten year old girl who wanders away from her parents along a path that leads to a world ruled by strange and unusual monster-like animals. Her parent.... Budget: $15M, Revenue: $275M, Rating: 8.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/129",
      "title": "Spirited Away",
      "genres": [
        "Adventure",
        "Animation",
        "Family",
        "Fantasy"
      ],
      "plot": "A ten year old girl who wanders away from her parents along a path that leads to a world ruled by strange and unusual monster-like animals. Her parents have been changed into pigs along with others inside a bathhouse full of these creatures. Will she ever see the world how it once was?",
      "budget": 15000000.0,
      "release_date": "2001-07-20",
      "rating": 8.3,
      "revenue": 274925095.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_33",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Forrest Gump",
    "text": "Forrest Gump (1994). is a Comedy, Drama, Romance movie. Plot: A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what a.... Budget: $55M, Revenue: $678M, Rating: 8.2/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/13",
      "title": "Forrest Gump",
      "genres": [
        "Comedy",
        "Drama",
        "Romance"
      ],
      "plot": "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. 'Forrest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.",
      "budget": 55000000.0,
      "release_date": "1994-07-06",
      "rating": 8.2,
      "revenue": 677945399.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_34",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hunger Games: Mockingjay - Part 1",
    "text": "The Hunger Games: Mockingjay - Part 1 (2014). is a Adventure, ScienceFiction, Thriller movie. Plot: Katniss Everdeen reluctantly becomes the symbol of a mass rebellion against the autocratic Capitol..... Budget: $125M, Revenue: $752M, Rating: 6.6/10. Part of The Hunger Games Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/131631",
      "title": "The Hunger Games: Mockingjay - Part 1",
      "genres": [
        "Adventure",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Katniss Everdeen reluctantly becomes the symbol of a mass rebellion against the autocratic Capitol.",
      "budget": 125000000.0,
      "release_date": "2014-11-18",
      "rating": 6.6,
      "revenue": 752100229.0,
      "cast": [],
      "collection": "The Hunger Games Collection"
    }
  },
  {
    "id": "entity_movie_35",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hunger Games: Mockingjay - Part 2",
    "text": "The Hunger Games: Mockingjay - Part 2 (2015). is a Action, Adventure, ScienceFiction movie. Plot: With the nation of Panem in a full scale war, Katniss confronts President Snow in the final showdown. Teamed with a group of her closest friends – inc.... Budget: $160M, Revenue: $653M, Rating: 6.6/10. Part of The Hunger Games Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/131634",
      "title": "The Hunger Games: Mockingjay - Part 2",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "With the nation of Panem in a full scale war, Katniss confronts President Snow in the final showdown. Teamed with a group of her closest friends – including Gale, Finnick, and Peeta – Katniss goes off on a mission with the unit from District 13 as they risk their lives to stage an assassination attempt on President Snow who has become increasingly obsessed with destroying her. The mortal traps, enemies, and moral choices that await Katniss will challenge her more than any arena she faced in The Hunger Games.",
      "budget": 160000000.0,
      "release_date": "2015-11-18",
      "rating": 6.6,
      "revenue": 653428261.0,
      "cast": [],
      "collection": "The Hunger Games Collection"
    }
  },
  {
    "id": "entity_movie_36",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Trek",
    "text": "Star Trek (2009). is a Action, Adventure, ScienceFiction movie. Plot: The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan.... Budget: $150M, Revenue: $386M, Rating: 7.4/10. Part of Star Trek: Alternate Reality Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/13475",
      "title": "Star Trek",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again.",
      "budget": 150000000.0,
      "release_date": "2009-05-06",
      "rating": 7.4,
      "revenue": 385680446.0,
      "cast": [],
      "collection": "Star Trek: Alternate Reality Collection"
    }
  },
  {
    "id": "entity_movie_37",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Jurassic World",
    "text": "Jurassic World (2015). is a Action, Adventure, ScienceFiction movie. Plot: Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally en.... Budget: $150M, Revenue: $1514M, Rating: 6.5/10. Part of Jurassic Park Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/135397",
      "title": "Jurassic World",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
      "budget": 150000000.0,
      "release_date": "2015-06-09",
      "rating": 6.5,
      "revenue": 1513528810.0,
      "cast": [],
      "collection": "Jurassic Park Collection"
    }
  },
  {
    "id": "entity_movie_38",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Edge of Tomorrow",
    "text": "Edge of Tomorrow (2014). is a Action, ScienceFiction movie. Plot: Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within min.... Budget: $178M, Revenue: $371M, Rating: 7.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/137113",
      "title": "Edge of Tomorrow",
      "genres": [
        "Action",
        "ScienceFiction"
      ],
      "plot": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop.",
      "budget": 178000000.0,
      "release_date": "2014-05-27",
      "rating": 7.6,
      "revenue": 370541256.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_39",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Wars: The Force Awakens",
    "text": "Star Wars: The Force Awakens (2015). is a Action, Adventure, Fantasy movie. Plot: Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers..... Budget: $245M, Revenue: $2068M, Rating: 7.5/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/140607",
      "title": "Star Wars: The Force Awakens",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
      "budget": 245000000.0,
      "release_date": "2015-12-15",
      "rating": 7.5,
      "revenue": 2068223624.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_40",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Up",
    "text": "Up (2009). is a Adventure, Animation, Comedy movie. Plot: Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed .... Budget: $175M, Revenue: $735M, Rating: 7.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/14160",
      "title": "Up",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
      "budget": 175000000.0,
      "release_date": "2009-05-13",
      "rating": 7.8,
      "revenue": 735099082.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_41",
    "type": "entity",
    "entity_type": "Movie",
    "title": "2012",
    "text": "2012 (2009). is a Action, Adventure, ScienceFiction movie. Plot: Dr. Adrian Helmsley, part of a worldwide geophysical team investigating the effect on the earth of radiation from unprecedented solar storms, learns t.... Budget: $200M, Revenue: $770M, Rating: 5.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/14161",
      "title": "2012",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Dr. Adrian Helmsley, part of a worldwide geophysical team investigating the effect on the earth of radiation from unprecedented solar storms, learns that the earth's core is heating up. He warns U.S. President Thomas Wilson that the crust of the earth is becoming unstable and that without proper preparations for saving a fraction of the world's population, the entire race is doomed. Meanwhile, writer Jackson Curtis stumbles on the same information. While the world's leaders race to build \"arks\" to escape the impending cataclysm, Curtis struggles to find a way to save his family. Meanwhile, volcanic eruptions and earthquakes of unprecedented strength wreak havoc around the world.",
      "budget": 200000000.0,
      "release_date": "2009-10-10",
      "rating": 5.6,
      "revenue": 769653595.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_42",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Departed",
    "text": "The Departed (2006). is a Crime, Drama, Thriller movie. Plot: To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewi.... Budget: $90M, Revenue: $290M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1422",
      "title": "The Departed",
      "genres": [
        "Crime",
        "Drama",
        "Thriller"
      ],
      "plot": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
      "budget": 90000000.0,
      "release_date": "2006-10-05",
      "rating": 7.9,
      "revenue": 289847354.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_43",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Inside Out",
    "text": "Inside Out (2015). is a Animation, Comedy, Drama movie. Plot: Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francis.... Budget: $175M, Revenue: $858M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/150540",
      "title": "Inside Out",
      "genres": [
        "Animation",
        "Comedy",
        "Drama",
        "Family"
      ],
      "plot": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.",
      "budget": 175000000.0,
      "release_date": "2015-06-09",
      "rating": 7.9,
      "revenue": 857611174.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_44",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Her",
    "text": "Her (2013). is a Drama, Romance, ScienceFiction movie. Plot: In the not so distant future, Theodore, a lonely writer purchases a newly developed operating system designed to meet the user's every needs. To Theor.... Budget: $23M, Revenue: $47M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/152601",
      "title": "Her",
      "genres": [
        "Drama",
        "Romance",
        "ScienceFiction"
      ],
      "plot": "In the not so distant future, Theodore, a lonely writer purchases a newly developed operating system designed to meet the user's every needs. To Theordore's surprise, a romantic relationship develops between him and his operating system. This unconventional love story blends science fiction and romance in a sweet tale that explores the nature of love and the ways that technology isolates and connects us all.",
      "budget": 23000000.0,
      "release_date": "2013-12-18",
      "rating": 7.9,
      "revenue": 47351251.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_45",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Dark Knight",
    "text": "The Dark Knight (2008). is a Action, Crime, Drama movie. Plot: Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the rema.... Budget: $185M, Revenue: $1005M, Rating: 8.3/10. Part of The Dark Knight Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/155",
      "title": "The Dark Knight",
      "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
      ],
      "plot": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "budget": 185000000.0,
      "release_date": "2008-07-16",
      "rating": 8.3,
      "revenue": 1004558444.0,
      "cast": [],
      "collection": "The Dark Knight Collection"
    }
  },
  {
    "id": "entity_movie_46",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Interstellar",
    "text": "Interstellar (2014). is a Adventure, Drama, ScienceFiction movie. Plot: Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space t.... Budget: $165M, Revenue: $675M, Rating: 8.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/157336",
      "title": "Interstellar",
      "genres": [
        "Adventure",
        "Drama",
        "ScienceFiction"
      ],
      "plot": "Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "budget": 165000000.0,
      "release_date": "2014-11-05",
      "rating": 8.1,
      "revenue": 675120017.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_47",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Divergent",
    "text": "Divergent (2014). is a Action, Adventure, ScienceFiction movie. Plot: In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers .... Budget: $85M, Revenue: $289M, Rating: 6.9/10. Part of Divergent Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/157350",
      "title": "Divergent",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.",
      "budget": 85000000.0,
      "release_date": "2014-03-14",
      "rating": 6.9,
      "revenue": 288747895.0,
      "cast": [],
      "collection": "Divergent Collection"
    }
  },
  {
    "id": "entity_movie_48",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Ocean's Eleven",
    "text": "Ocean's Eleven (2001). is a Crime, Thriller movie. Plot: Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of spec.... Budget: $85M, Revenue: $451M, Rating: 7.2/10. Part of Ocean's Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/161",
      "title": "Ocean's Eleven",
      "genres": [
        "Crime",
        "Thriller"
      ],
      "plot": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.",
      "budget": 85000000.0,
      "release_date": "2001-12-07",
      "rating": 7.2,
      "revenue": 450717150.0,
      "cast": [],
      "collection": "Ocean's Collection"
    }
  },
  {
    "id": "entity_movie_49",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Back to the Future Part II",
    "text": "Back to the Future Part II (1989). is a Adventure, Comedy, Family movie. Plot: Marty and Doc are at it again in this wacky sequel to the 1985 blockbuster as the time-traveling duo head to 2015 to nip some McFly family woes in the.... Budget: $40M, Revenue: $332M, Rating: 7.4/10. Part of Back to the Future Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/165",
      "title": "Back to the Future Part II",
      "genres": [
        "Adventure",
        "Comedy",
        "Family",
        "ScienceFiction"
      ],
      "plot": "Marty and Doc are at it again in this wacky sequel to the 1985 blockbuster as the time-traveling duo head to 2015 to nip some McFly family woes in the bud. But things go awry thanks to bully Biff Tannen and a pesky sports almanac. In a last-ditch attempt to set things straight, Marty finds himself bound for 1955 and face to face with his teenage parents -- again.",
      "budget": 40000000.0,
      "release_date": "1989-11-20",
      "rating": 7.4,
      "revenue": 332000000.0,
      "cast": [],
      "collection": "Back to the Future Collection"
    }
  },
  {
    "id": "entity_movie_50",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Furious 7",
    "text": "Furious 7 (2015). is a Action movie. Plot: Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother..... Budget: $190M, Revenue: $1506M, Rating: 7.3/10. Part of The Fast and the Furious Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/168259",
      "title": "Furious 7",
      "genres": [
        "Action"
      ],
      "plot": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.",
      "budget": 190000000.0,
      "release_date": "2015-04-01",
      "rating": 7.3,
      "revenue": 1506249360.0,
      "cast": [],
      "collection": "The Fast and the Furious Collection"
    }
  },
  {
    "id": "entity_movie_51",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Inglourious Basterds",
    "text": "Inglourious Basterds (2009). is a Action, Drama, Thriller movie. Plot: In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throug.... Budget: $70M, Revenue: $319M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/16869",
      "title": "Inglourious Basterds",
      "genres": [
        "Action",
        "Drama",
        "Thriller",
        "War"
      ],
      "plot": "In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throughout the Third Reich by scalping and brutally killing Nazis. The Basterds, lead by Lt. Aldo Raine soon cross paths with a French-Jewish teenage girl who runs a movie theater in Paris which is targeted by the soldiers.",
      "budget": 70000000.0,
      "release_date": "2009-08-18",
      "rating": 7.9,
      "revenue": 319131050.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_52",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Iron Man",
    "text": "Iron Man (2008). is a Action, Adventure, ScienceFiction movie. Plot: After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil..... Budget: $140M, Revenue: $585M, Rating: 7.4/10. Part of Iron Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1726",
      "title": "Iron Man",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
      "budget": 140000000.0,
      "release_date": "2008-04-30",
      "rating": 7.4,
      "revenue": 585174222.0,
      "cast": [],
      "collection": "Iron Man Collection"
    }
  },
  {
    "id": "entity_movie_53",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Captain America: The First Avenger",
    "text": "Captain America: The First Avenger (2011). is a Action, Adventure, ScienceFiction movie. Plot: Predominantly set during World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the w.... Budget: $140M, Revenue: $371M, Rating: 6.6/10. Part of Captain America Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1771",
      "title": "Captain America: The First Avenger",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Predominantly set during World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull – Adolf Hitler's ruthless head of weaponry, and the leader of an organization that intends to use a mysterious device of untold powers for world domination.",
      "budget": 140000000.0,
      "release_date": "2011-07-22",
      "rating": 6.6,
      "revenue": 370569774.0,
      "cast": [],
      "collection": "Captain America Collection"
    }
  },
  {
    "id": "entity_movie_54",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Big Hero 6",
    "text": "Big Hero 6 (2014). is a Action, Adventure, Animation movie. Plot: The special bond that develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band.... Budget: $165M, Revenue: $652M, Rating: 7.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/177572",
      "title": "Big Hero 6",
      "genres": [
        "Action",
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "The special bond that develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
      "budget": 165000000.0,
      "release_date": "2014-10-24",
      "rating": 7.8,
      "revenue": 652105443.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_55",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Fifth Element",
    "text": "The Fifth Element (1997). is a Action, Adventure, Fantasy movie. Plot: In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity..... Budget: $90M, Revenue: $264M, Rating: 7.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/18",
      "title": "The Fifth Element",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity.",
      "budget": 90000000.0,
      "release_date": "1997-05-07",
      "rating": 7.3,
      "revenue": 263920180.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_56",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Transformers",
    "text": "Transformers (2007). is a Action, Adventure, ScienceFiction movie. Plot: Young teenager, Sam Witwicky becomes involved in the ancient struggle between two extraterrestrial factions of transforming robots – the heroic Autobo.... Budget: $150M, Revenue: $710M, Rating: 6.6/10. Part of Transformers Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1858",
      "title": "Transformers",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Young teenager, Sam Witwicky becomes involved in the ancient struggle between two extraterrestrial factions of transforming robots – the heroic Autobots and the evil Decepticons. Sam holds the clue to unimaginable power and the Decepticons will stop at nothing to retrieve it.",
      "budget": 150000000.0,
      "release_date": "2007-06-27",
      "rating": 6.6,
      "revenue": 709709780.0,
      "cast": [],
      "collection": "Transformers Collection"
    }
  },
  {
    "id": "entity_movie_57",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Pirates of the Caribbean: On Stranger Tides",
    "text": "Pirates of the Caribbean: On Stranger Tides (2011). is a Action, Adventure, Fantasy movie. Plot: Captain Jack Sparrow crosses paths with a woman from his past, and he's not sure if it's love -- or if she's a ruthless con artist who's using him to .... Budget: $380M, Revenue: $1046M, Rating: 6.4/10. Part of Pirates of the Caribbean Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1865",
      "title": "Pirates of the Caribbean: On Stranger Tides",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Captain Jack Sparrow crosses paths with a woman from his past, and he's not sure if it's love -- or if she's a ruthless con artist who's using him to find the fabled Fountain of Youth. When she forces him aboard the Queen Anne's Revenge, the ship of the formidable pirate Blackbeard, Jack finds himself on an unexpected adventure in which he doesn't know who to fear more: Blackbeard or the woman from his past.",
      "budget": 380000000.0,
      "release_date": "2011-05-14",
      "rating": 6.4,
      "revenue": 1045713802.0,
      "cast": [],
      "collection": "Pirates of the Caribbean Collection"
    }
  },
  {
    "id": "entity_movie_58",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hangover",
    "text": "The Hangover (2009). is a Comedy movie. Plot: When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But th.... Budget: $35M, Revenue: $459M, Rating: 7.2/10. Part of The Hangover Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/18785",
      "title": "The Hangover",
      "genres": [
        "Comedy"
      ],
      "plot": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
      "budget": 35000000.0,
      "release_date": "2009-06-05",
      "rating": 7.2,
      "revenue": 459270619.0,
      "cast": [],
      "collection": "The Hangover Collection"
    }
  },
  {
    "id": "entity_movie_59",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Empire Strikes Back",
    "text": "The Empire Strikes Back (1980). is a Action, Adventure, ScienceFiction movie. Plot: The epic saga continues as Luke Skywalker, in hopes of defeating the evil Galactic Empire, learns the ways of the Jedi from aging master Yoda. But Dar.... Budget: $18M, Revenue: $538M, Rating: 8.2/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1891",
      "title": "The Empire Strikes Back",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "The epic saga continues as Luke Skywalker, in hopes of defeating the evil Galactic Empire, learns the ways of the Jedi from aging master Yoda. But Darth Vader is more determined than ever to capture Luke. Meanwhile, rebel leader Princess Leia, cocky Han Solo, Chewbacca, and droids C-3PO and R2-D2 are thrown into various stages of capture, betrayal and despair.",
      "budget": 18000000.0,
      "release_date": "1980-05-17",
      "rating": 8.2,
      "revenue": 538400000.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_60",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Return of the Jedi",
    "text": "Return of the Jedi (1983). is a Action, Adventure, ScienceFiction movie. Plot: As Rebel leaders map their strategy for an all-out attack on the Emperor's newer, bigger Death Star. Han Solo remains frozen in the cavernous desert f.... Budget: $32M, Revenue: $573M, Rating: 7.9/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1892",
      "title": "Return of the Jedi",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "As Rebel leaders map their strategy for an all-out attack on the Emperor's newer, bigger Death Star. Han Solo remains frozen in the cavernous desert fortress of Jabba the Hutt, the most loathsome outlaw in the universe, who is also keeping Princess Leia as a slave girl. Now a master of the Force, Luke Skywalker rescues his friends, but he cannot become a true Jedi Knight until he wages his own crucial battle against Darth Vader, who has sworn to win Luke over to the dark side of the Force.",
      "budget": 32350000.0,
      "release_date": "1983-05-23",
      "rating": 7.9,
      "revenue": 572700000.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_61",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Wars: Episode I - The Phantom Menace",
    "text": "Star Wars: Episode I - The Phantom Menace (1999). is a Action, Adventure, ScienceFiction movie. Plot: Anakin Skywalker, a young slave strong with the Force, is discovered on Tatooine. Meanwhile, the evil Sith have returned, enacting their plot for reve.... Budget: $115M, Revenue: $924M, Rating: 6.4/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1893",
      "title": "Star Wars: Episode I - The Phantom Menace",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Anakin Skywalker, a young slave strong with the Force, is discovered on Tatooine. Meanwhile, the evil Sith have returned, enacting their plot for revenge against the Jedi.",
      "budget": 115000000.0,
      "release_date": "1999-05-19",
      "rating": 6.4,
      "revenue": 924317558.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_62",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Wars: Episode II - Attack of the Clones",
    "text": "Star Wars: Episode II - Attack of the Clones (2002). is a Action, Adventure, ScienceFiction movie. Plot: Ten years after the invasion of Naboo, the galaxy is on the brink of civil war. Under the leadership of a renegade Jedi named Count Dooku, thousands o.... Budget: $120M, Revenue: $649M, Rating: 6.4/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1894",
      "title": "Star Wars: Episode II - Attack of the Clones",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Ten years after the invasion of Naboo, the galaxy is on the brink of civil war. Under the leadership of a renegade Jedi named Count Dooku, thousands of solar systems threaten to break away from the Galactic Republic. When an assassination attempt is made on Senator Padmé Amidala, the former Queen of Naboo, twenty-year-old Jedi apprentice Anakin Skywalker is assigned to protect her. In the course of his mission, Anakin discovers his love for Padmé as well as his own darker side. Soon, Anakin, Padmé, and Obi-Wan Kenobi are drawn into the heart of the Separatist movement and the beginning of the Clone Wars.",
      "budget": 120000000.0,
      "release_date": "2002-05-15",
      "rating": 6.4,
      "revenue": 649398328.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_63",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Wars: Episode III - Revenge of the Sith",
    "text": "Star Wars: Episode III - Revenge of the Sith (2005). is a Action, Adventure, ScienceFiction movie. Plot: Years after the onset of the Clone Wars, the noble Jedi Knights lead a massive clone army into a galaxy-wide battle against the Separatists. When the .... Budget: $113M, Revenue: $850M, Rating: 7.1/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1895",
      "title": "Star Wars: Episode III - Revenge of the Sith",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Years after the onset of the Clone Wars, the noble Jedi Knights lead a massive clone army into a galaxy-wide battle against the Separatists. When the sinister Sith unveil a thousand-year-old plot to rule the galaxy, the Republic crumbles and from its ashes rises the evil Galactic Empire. Jedi hero Anakin Skywalker is seduced by the dark side of the Force to become the Emperor's new apprentice – Darth Vader. The Jedi are decimated, as Obi-Wan Kenobi and Jedi Master Yoda are forced into hiding. The only hope for the galaxy are Anakin's own offspring – the twin children born in secrecy who will grow up to become heroes.",
      "budget": 113000000.0,
      "release_date": "2005-05-17",
      "rating": 7.1,
      "revenue": 850000000.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_64",
    "type": "entity",
    "entity_type": "Movie",
    "title": "American Sniper",
    "text": "American Sniper (2014). is a Action, War movie. Plot: U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pin.... Budget: $59M, Revenue: $542M, Rating: 7.4/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/190859",
      "title": "American Sniper",
      "genres": [
        "Action",
        "War"
      ],
      "plot": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
      "budget": 58800000.0,
      "release_date": "2014-12-11",
      "rating": 7.4,
      "revenue": 542307423.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_65",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Amazing Spider-Man",
    "text": "The Amazing Spider-Man (2012). is a Action, Adventure, Fantasy movie. Plot: Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenager.... Budget: $215M, Revenue: $752M, Rating: 6.5/10. Part of The Amazing Spider-Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/1930",
      "title": "The Amazing Spider-Man",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.",
      "budget": 215000000.0,
      "release_date": "2012-06-27",
      "rating": 6.5,
      "revenue": 752215857.0,
      "cast": [],
      "collection": "The Amazing Spider-Man Collection"
    }
  },
  {
    "id": "entity_movie_66",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Birdman",
    "text": "Birdman (2014). is a Comedy, Drama movie. Plot: A fading actor best known for his portrayal of a popular superhero attempts to mount a comeback by appearing in a Broadway play. As opening night appr.... Budget: $18M, Revenue: $103M, Rating: 7.4/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/194662",
      "title": "Birdman",
      "genres": [
        "Comedy",
        "Drama"
      ],
      "plot": "A fading actor best known for his portrayal of a popular superhero attempts to mount a comeback by appearing in a Broadway play. As opening night approaches, his attempts to become more altruistic, rebuild his career, and reconnect with friends and family prove more difficult than expected.",
      "budget": 18000000.0,
      "release_date": "2014-08-27",
      "rating": 7.4,
      "revenue": 103215094.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_67",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Maze Runner",
    "text": "The Maze Runner (2014). is a Action, Mystery, ScienceFiction movie. Plot: Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a m.... Budget: $34M, Revenue: $348M, Rating: 7.0/10. Part of The Maze Runner Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/198663",
      "title": "The Maze Runner",
      "genres": [
        "Action",
        "Mystery",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow \"runners\" for a shot at escape.",
      "budget": 34000000.0,
      "release_date": "2014-09-10",
      "rating": 7.0,
      "revenue": 348319861.0,
      "cast": [],
      "collection": "The Maze Runner Collection"
    }
  },
  {
    "id": "entity_movie_68",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Avatar",
    "text": "Avatar (2009). is a Action, Adventure, Fantasy movie. Plot: In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecti.... Budget: $237M, Revenue: $2788M, Rating: 7.2/10. Part of Avatar Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/19995",
      "title": "Avatar",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
      "budget": 237000000.0,
      "release_date": "2009-12-10",
      "rating": 7.2,
      "revenue": 2787965087.0,
      "cast": [],
      "collection": "Avatar Collection"
    }
  },
  {
    "id": "entity_movie_69",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Despicable Me",
    "text": "Despicable Me (2010). is a Animation, Family movie. Plot: Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sk.... Budget: $69M, Revenue: $544M, Rating: 7.1/10. Part of Despicable Me Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/20352",
      "title": "Despicable Me",
      "genres": [
        "Animation",
        "Family"
      ],
      "plot": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
      "budget": 69000000.0,
      "release_date": "2010-07-08",
      "rating": 7.1,
      "revenue": 543513985.0,
      "cast": [],
      "collection": "Despicable Me Collection"
    }
  },
  {
    "id": "entity_movie_70",
    "type": "entity",
    "entity_type": "Movie",
    "title": "I, Robot",
    "text": "I, Robot (2004). is a Action, ScienceFiction movie. Plot: In 2035, where robots are common-place and abide by the three laws of robotics, a techno-phobic cop investigates an apparent suicide. Suspecting that .... Budget: $120M, Revenue: $347M, Rating: 6.7/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/2048",
      "title": "I, Robot",
      "genres": [
        "Action",
        "ScienceFiction"
      ],
      "plot": "In 2035, where robots are common-place and abide by the three laws of robotics, a techno-phobic cop investigates an apparent suicide. Suspecting that a robot may be responsible for the death, his investigation leads him to believe that humanity may be in danger.",
      "budget": 120000000.0,
      "release_date": "2004-07-15",
      "rating": 6.7,
      "revenue": 347234916.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_71",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Imitation Game",
    "text": "The Imitation Game (2014). is a Drama, History, Thriller movie. Plot: Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant te.... Budget: $14M, Revenue: $234M, Rating: 8.0/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/205596",
      "title": "The Imitation Game",
      "genres": [
        "Drama",
        "History",
        "Thriller",
        "War"
      ],
      "plot": "Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant team of code-breakers at Britain's top-secret Government Code and Cypher School at Bletchley Park, during the darkest days of World War II.",
      "budget": 14000000.0,
      "release_date": "2014-11-14",
      "rating": 8.0,
      "revenue": 233555708.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_72",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Ratatouille",
    "text": "Ratatouille (2007). is a Animation, Comedy, Family movie. Plot: A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobi.... Budget: $150M, Revenue: $624M, Rating: 7.5/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/2062",
      "title": "Ratatouille",
      "genres": [
        "Animation",
        "Comedy",
        "Family",
        "Fantasy"
      ],
      "plot": "A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.",
      "budget": 150000000.0,
      "release_date": "2007-06-22",
      "rating": 7.5,
      "revenue": 623722818.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_73",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Spectre",
    "text": "Spectre (2015). is a Action, Adventure, Crime movie. Plot: A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret servic.... Budget: $245M, Revenue: $881M, Rating: 6.3/10. Part of James Bond Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/206647",
      "title": "Spectre",
      "genres": [
        "Action",
        "Adventure",
        "Crime"
      ],
      "plot": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
      "budget": 245000000.0,
      "release_date": "2015-10-26",
      "rating": 6.3,
      "revenue": 880674609.0,
      "cast": [],
      "collection": "James Bond Collection"
    }
  },
  {
    "id": "entity_movie_74",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Kingsman: The Secret Service",
    "text": "Kingsman: The Secret Service (2015). is a Action, Adventure, Comedy movie. Plot: The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program .... Budget: $81M, Revenue: $414M, Rating: 7.6/10. Part of Kingsman Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/207703",
      "title": "Kingsman: The Secret Service",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "Crime"
      ],
      "plot": "The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.",
      "budget": 81000000.0,
      "release_date": "2015-01-29",
      "rating": 7.6,
      "revenue": 414351546.0,
      "cast": [],
      "collection": "Kingsman Collection"
    }
  },
  {
    "id": "entity_movie_75",
    "type": "entity",
    "entity_type": "Movie",
    "title": "X-Men Origins: Wolverine",
    "text": "X-Men Origins: Wolverine (2009). is a Action, Adventure, ScienceFiction movie. Plot: After seeking to live a normal life, Logan sets out to avenge the death of his girlfriend by undergoing the mutant Weapon X program and becoming Wolve.... Budget: $150M, Revenue: $373M, Rating: 6.2/10. Part of The Wolverine Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/2080",
      "title": "X-Men Origins: Wolverine",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "After seeking to live a normal life, Logan sets out to avenge the death of his girlfriend by undergoing the mutant Weapon X program and becoming Wolverine.",
      "budget": 150000000.0,
      "release_date": "2009-04-28",
      "rating": 6.2,
      "revenue": 373062864.0,
      "cast": [],
      "collection": "The Wolverine Collection"
    }
  },
  {
    "id": "entity_movie_76",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Batman v Superman: Dawn of Justice",
    "text": "Batman v Superman: Dawn of Justice (2016). is a Action, Adventure, Fantasy movie. Plot: Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, mode.... Budget: $250M, Revenue: $873M, Rating: 5.7/10. Part of Man of Steel Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/209112",
      "title": "Batman v Superman: Dawn of Justice",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
      "budget": 250000000.0,
      "release_date": "2016-03-23",
      "rating": 5.7,
      "revenue": 873260194.0,
      "cast": [],
      "collection": "Man of Steel Collection"
    }
  },
  {
    "id": "entity_movie_77",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Gone Girl",
    "text": "Gone Girl (2014). is a Drama, Mystery, Thriller movie. Plot: With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he m.... Budget: $61M, Revenue: $369M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/210577",
      "title": "Gone Girl",
      "genres": [
        "Drama",
        "Mystery",
        "Thriller"
      ],
      "plot": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
      "budget": 61000000.0,
      "release_date": "2014-10-01",
      "rating": 7.9,
      "revenue": 369330363.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_78",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Minions",
    "text": "Minions (2015). is a Adventure, Animation, Comedy movie. Plot: Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over.... Budget: $74M, Revenue: $1157M, Rating: 6.4/10. Part of Despicable Me Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/211672",
      "title": "Minions",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
      "budget": 74000000.0,
      "release_date": "2015-06-17",
      "rating": 6.4,
      "revenue": 1156730962.0,
      "cast": [],
      "collection": "Despicable Me Collection"
    }
  },
  {
    "id": "entity_movie_79",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Terminator",
    "text": "The Terminator (1984). is a Action, ScienceFiction, Thriller movie. Plot: In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Con.... Budget: $6M, Revenue: $78M, Rating: 7.4/10. Part of The Terminator Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/218",
      "title": "The Terminator",
      "genres": [
        "Action",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?",
      "budget": 6400000.0,
      "release_date": "1984-10-26",
      "rating": 7.4,
      "revenue": 78371200.0,
      "cast": [],
      "collection": "The Terminator Collection"
    }
  },
  {
    "id": "entity_movie_80",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
    "text": "Pirates of the Caribbean: The Curse of the Black Pearl (2003). is a Action, Adventure, Fantasy movie. Plot: Jack Sparrow, a freewheeling 17th-century pirate who roams the Caribbean Sea, butts heads with a rival pirate bent on pillaging the village of Port Ro.... Budget: $140M, Revenue: $655M, Rating: 7.5/10. Part of Pirates of the Caribbean Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/22",
      "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Jack Sparrow, a freewheeling 17th-century pirate who roams the Caribbean Sea, butts heads with a rival pirate bent on pillaging the village of Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her. But their seafaring mission is hardly simple.",
      "budget": 140000000.0,
      "release_date": "2003-07-09",
      "rating": 7.5,
      "revenue": 655011224.0,
      "cast": [],
      "collection": "Pirates of the Caribbean Collection"
    }
  },
  {
    "id": "entity_movie_81",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Fault in Our Stars",
    "text": "The Fault in Our Stars (2014). is a Drama, Romance movie. Plot: Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed u.... Budget: $12M, Revenue: $307M, Rating: 7.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/222935",
      "title": "The Fault in Our Stars",
      "genres": [
        "Drama",
        "Romance"
      ],
      "plot": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
      "budget": 12000000.0,
      "release_date": "2014-05-16",
      "rating": 7.6,
      "revenue": 307166834.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_82",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Fury",
    "text": "Fury (2014). is a Action, Drama, War movie. Plot: Last months of World War II in April 1945. As the Allies make their final push in the European Theater, a battle-hardened U.S. Army sergeant in the 2n.... Budget: $68M, Revenue: $212M, Rating: 7.4/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/228150",
      "title": "Fury",
      "genres": [
        "Action",
        "Drama",
        "War"
      ],
      "plot": "Last months of World War II in April 1945. As the Allies make their final push in the European Theater, a battle-hardened U.S. Army sergeant in the 2nd Armored Division named Wardaddy commands a Sherman tank called \"Fury\" and its five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.",
      "budget": 68000000.0,
      "release_date": "2014-10-15",
      "rating": 7.4,
      "revenue": 211817906.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_83",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Kick-Ass",
    "text": "Kick-Ass (2010). is a Action, Crime movie. Plot: Dave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a super-hero, even though he has no powers, trainin.... Budget: $28M, Revenue: $96M, Rating: 7.1/10. Part of Kick-Ass Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/23483",
      "title": "Kick-Ass",
      "genres": [
        "Action",
        "Crime"
      ],
      "plot": "Dave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a super-hero, even though he has no powers, training or meaningful reason to do so.",
      "budget": 28000000.0,
      "release_date": "2010-03-22",
      "rating": 7.1,
      "revenue": 96188903.0,
      "cast": [],
      "collection": "Kick-Ass Collection"
    }
  },
  {
    "id": "entity_movie_84",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Godfather",
    "text": "The Godfather (1972). is a Crime, Drama movie. Plot: Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corl.... Budget: $6M, Revenue: $245M, Rating: 8.5/10. Part of The Godfather Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/238",
      "title": "The Godfather",
      "genres": [
        "Crime",
        "Drama"
      ],
      "plot": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
      "budget": 6000000.0,
      "release_date": "1972-03-14",
      "rating": 8.5,
      "revenue": 245066411.0,
      "cast": [],
      "collection": "The Godfather Collection"
    }
  },
  {
    "id": "entity_movie_85",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Kill Bill: Vol. 1",
    "text": "Kill Bill: Vol. 1 (2003). is a Action, Crime movie. Plot: An assassin is shot at the altar by her ruthless employer, Bill and other members of their assassination circle – but 'The Bride' lives to plot her ve.... Budget: $30M, Revenue: $181M, Rating: 7.7/10. Part of Kill Bill Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/24",
      "title": "Kill Bill: Vol. 1",
      "genres": [
        "Action",
        "Crime"
      ],
      "plot": "An assassin is shot at the altar by her ruthless employer, Bill and other members of their assassination circle – but 'The Bride' lives to plot her vengeance. Setting out for some payback, she makes a death list and hunts down those who wronged her, saving Bill for last.",
      "budget": 30000000.0,
      "release_date": "2003-10-10",
      "rating": 7.7,
      "revenue": 180949000.0,
      "cast": [],
      "collection": "Kill Bill Collection"
    }
  },
  {
    "id": "entity_movie_86",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Lucy",
    "text": "Lucy (2014). is a Action, ScienceFiction movie. Plot: A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic..... Budget: $40M, Revenue: $127M, Rating: 6.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/240832",
      "title": "Lucy",
      "genres": [
        "Action",
        "ScienceFiction"
      ],
      "plot": "A woman, accidentally caught in a dark deal, turns the tables on her captors and transforms into a merciless warrior evolved beyond human logic.",
      "budget": 40000000.0,
      "release_date": "2014-07-14",
      "rating": 6.3,
      "revenue": 126546825.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_87",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Avengers",
    "text": "The Avengers (2012). is a Action, Adventure, ScienceFiction movie. Plot: When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.... Budget: $220M, Revenue: $1520M, Rating: 7.4/10. Part of The Avengers Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/24428",
      "title": "The Avengers",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
      "budget": 220000000.0,
      "release_date": "2012-04-25",
      "rating": 7.4,
      "revenue": 1519557910.0,
      "cast": [],
      "collection": "The Avengers Collection"
    }
  },
  {
    "id": "entity_movie_88",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Whiplash",
    "text": "Whiplash (2014). is a Drama movie. Plot: Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity..... Budget: $3M, Revenue: $13M, Rating: 8.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/244786",
      "title": "Whiplash",
      "genres": [
        "Drama"
      ],
      "plot": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.",
      "budget": 3300000.0,
      "release_date": "2014-10-10",
      "rating": 8.3,
      "revenue": 13092000.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_89",
    "type": "entity",
    "entity_type": "Movie",
    "title": "John Wick",
    "text": "John Wick (2014). is a Action, Thriller movie. Plot: Ex-lunatic John Wick comes off his meds to track down the bounders that killed his dog and made off with his self-respect.... Budget: $20M, Revenue: $89M, Rating: 7.0/10. Part of John Wick Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/245891",
      "title": "John Wick",
      "genres": [
        "Action",
        "Thriller"
      ],
      "plot": "Ex-lunatic John Wick comes off his meds to track down the bounders that killed his dog and made off with his self-respect",
      "budget": 20000000.0,
      "release_date": "2014-10-22",
      "rating": 7.0,
      "revenue": 88761661.0,
      "cast": [],
      "collection": "John Wick Collection"
    }
  },
  {
    "id": "entity_movie_90",
    "type": "entity",
    "entity_type": "Movie",
    "title": "X-Men: Apocalypse",
    "text": "X-Men: Apocalypse (2016). is a ScienceFiction movie. Plot: After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan..... Budget: $178M, Revenue: $544M, Rating: 6.4/10. Part of X-Men Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/246655",
      "title": "X-Men: Apocalypse",
      "genres": [
        "ScienceFiction"
      ],
      "plot": "After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan.",
      "budget": 178000000.0,
      "release_date": "2016-05-18",
      "rating": 6.4,
      "revenue": 543934787.0,
      "cast": [],
      "collection": "X-Men Collection"
    }
  },
  {
    "id": "entity_movie_91",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Fantastic Beasts and Where to Find Them",
    "text": "Fantastic Beasts and Where to Find Them (2016). is a Adventure, Family, Fantasy movie. Plot: In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of .... Budget: $180M, Revenue: $809M, Rating: 7.2/10. Part of Fantastic Beasts Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/259316",
      "title": "Fantastic Beasts and Where to Find Them",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
      "budget": 180000000.0,
      "release_date": "2016-11-16",
      "rating": 7.2,
      "revenue": 809342332.0,
      "cast": [],
      "collection": "Fantastic Beasts Collection"
    }
  },
  {
    "id": "entity_movie_92",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Insurgent",
    "text": "Insurgent (2015). is a Adventure, ScienceFiction, Thriller movie. Plot: Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart..... Budget: $110M, Revenue: $295M, Rating: 6.2/10. Part of Divergent Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/262500",
      "title": "Insurgent",
      "genres": [
        "Adventure",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart.",
      "budget": 110000000.0,
      "release_date": "2015-03-18",
      "rating": 6.2,
      "revenue": 295238201.0,
      "cast": [],
      "collection": "Divergent Collection"
    }
  },
  {
    "id": "entity_movie_93",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Logan",
    "text": "Logan (2017). is a Action, Drama, ScienceFiction movie. Plot: In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and .... Budget: $97M, Revenue: $617M, Rating: 7.6/10. Part of The Wolverine Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/263115",
      "title": "Logan",
      "genres": [
        "Action",
        "Drama",
        "ScienceFiction"
      ],
      "plot": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
      "budget": 97000000.0,
      "release_date": "2017-02-28",
      "rating": 7.6,
      "revenue": 616801808.0,
      "cast": [],
      "collection": "The Wolverine Collection"
    }
  },
  {
    "id": "entity_movie_94",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Ex Machina",
    "text": "Ex Machina (2015). is a Drama, ScienceFiction movie. Plot: Caleb, a 26 year old coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nath.... Budget: $15M, Revenue: $37M, Rating: 7.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/264660",
      "title": "Ex Machina",
      "genres": [
        "Drama",
        "ScienceFiction"
      ],
      "plot": "Caleb, a 26 year old coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.",
      "budget": 15000000.0,
      "release_date": "2015-01-21",
      "rating": 7.6,
      "revenue": 36869414.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_95",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Zootopia",
    "text": "Zootopia (2016). is a Adventure, Animation, Comedy movie. Plot: Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it .... Budget: $150M, Revenue: $1024M, Rating: 7.7/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/269149",
      "title": "Zootopia",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery.",
      "budget": 150000000.0,
      "release_date": "2016-02-11",
      "rating": 7.7,
      "revenue": 1023784195.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_96",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Captain America: Civil War",
    "text": "Captain America: Civil War (2016). is a Action, Adventure, ScienceFiction movie. Plot: Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarize.... Budget: $250M, Revenue: $1153M, Rating: 7.1/10. Part of Captain America Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/271110",
      "title": "Captain America: Civil War",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
      "budget": 250000000.0,
      "release_date": "2016-04-27",
      "rating": 7.1,
      "revenue": 1153304495.0,
      "cast": [],
      "collection": "Captain America Collection"
    }
  },
  {
    "id": "entity_movie_97",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Batman Begins",
    "text": "Batman Begins (2005). is a Action, Crime, Drama movie. Plot: Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable t.... Budget: $150M, Revenue: $374M, Rating: 7.5/10. Part of The Dark Knight Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/272",
      "title": "Batman Begins",
      "genres": [
        "Action",
        "Crime",
        "Drama"
      ],
      "plot": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
      "budget": 150000000.0,
      "release_date": "2005-06-10",
      "rating": 7.5,
      "revenue": 374218673.0,
      "cast": [],
      "collection": "The Dark Knight Collection"
    }
  },
  {
    "id": "entity_movie_98",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Inception",
    "text": "Inception (2010). is a Action, Adventure, Mystery movie. Plot: Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as pa.... Budget: $160M, Revenue: $826M, Rating: 8.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/27205",
      "title": "Inception",
      "genres": [
        "Action",
        "Adventure",
        "Mystery",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
      "budget": 160000000.0,
      "release_date": "2010-07-14",
      "rating": 8.1,
      "revenue": 825532764.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_99",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hateful Eight",
    "text": "The Hateful Eight (2015). is a Crime, Drama, Mystery movie. Plot: Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception..... Budget: $44M, Revenue: $156M, Rating: 7.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/273248",
      "title": "The Hateful Eight",
      "genres": [
        "Crime",
        "Drama",
        "Mystery",
        "Western"
      ],
      "plot": "Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception.",
      "budget": 44000000.0,
      "release_date": "2015-12-25",
      "rating": 7.6,
      "revenue": 155760117.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_100",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Silence of the Lambs",
    "text": "The Silence of the Lambs (1991). is a Crime, Drama, Thriller movie. Plot: FBI trainee, Clarice Starling ventures into a maximum-security asylum to pick the diseased brain of Hannibal Lecter, a psychiatrist turned homicidal c.... Budget: $19M, Revenue: $273M, Rating: 8.1/10. Part of The Hannibal Lecter Anthology collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/274",
      "title": "The Silence of the Lambs",
      "genres": [
        "Crime",
        "Drama",
        "Thriller"
      ],
      "plot": "FBI trainee, Clarice Starling ventures into a maximum-security asylum to pick the diseased brain of Hannibal Lecter, a psychiatrist turned homicidal cannibal. Starling needs clues to help her capture a serial killer. but her Faustian relationship with Lecter soon leads to his escape, and now two deranged killers are on the loose.",
      "budget": 19000000.0,
      "release_date": "1991-02-01",
      "rating": 8.1,
      "revenue": 272742922.0,
      "cast": [],
      "collection": "The Hannibal Lecter Anthology"
    }
  },
  {
    "id": "entity_movie_101",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Passengers",
    "text": "Passengers (2016). is a Adventure, Drama, Romance movie. Plot: A spacecraft traveling to a distant colony planet and transporting thousands of people has a malfunction in its sleep chambers. As a result, two passe.... Budget: $110M, Revenue: $303M, Rating: 6.7/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/274870",
      "title": "Passengers",
      "genres": [
        "Adventure",
        "Drama",
        "Romance",
        "ScienceFiction"
      ],
      "plot": "A spacecraft traveling to a distant colony planet and transporting thousands of people has a malfunction in its sleep chambers. As a result, two passengers are awakened 90 years early.",
      "budget": 110000000.0,
      "release_date": "2016-12-21",
      "rating": 6.7,
      "revenue": 303144152.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_102",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Shawshank Redemption",
    "text": "The Shawshank Redemption (1994). is a Crime, Drama movie. Plot: Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where .... Budget: $25M, Revenue: $28M, Rating: 8.5/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/278",
      "title": "The Shawshank Redemption",
      "genres": [
        "Crime",
        "Drama"
      ],
      "plot": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
      "budget": 25000000.0,
      "release_date": "1994-09-23",
      "rating": 8.5,
      "revenue": 28341469.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_103",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Terminator 2: Judgment Day",
    "text": "Terminator 2: Judgment Day (1991). is a Action, ScienceFiction, Thriller movie. Plot: Nearly 10 years have passed since Sarah Connor was targeted for termination by a cyborg from the future. Now her son, John, the future leader of the r.... Budget: $100M, Revenue: $520M, Rating: 7.7/10. Part of The Terminator Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/280",
      "title": "Terminator 2: Judgment Day",
      "genres": [
        "Action",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Nearly 10 years have passed since Sarah Connor was targeted for termination by a cyborg from the future. Now her son, John, the future leader of the resistance, is the target for a newer, more deadly terminator. Once again, the resistance has managed to send a protector back to attempt to save John and his mother Sarah.",
      "budget": 100000000.0,
      "release_date": "1991-07-01",
      "rating": 7.7,
      "revenue": 520000000.0,
      "cast": [],
      "collection": "The Terminator Collection"
    }
  },
  {
    "id": "entity_movie_104",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Revenant",
    "text": "The Revenant (2015). is a Adventure, Drama, Thriller movie. Plot: In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling..... Budget: $135M, Revenue: $533M, Rating: 7.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/281957",
      "title": "The Revenant",
      "genres": [
        "Adventure",
        "Drama",
        "Thriller",
        "Western"
      ],
      "plot": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
      "budget": 135000000.0,
      "release_date": "2015-12-25",
      "rating": 7.3,
      "revenue": 532950503.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_105",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Guardians of the Galaxy Vol. 2",
    "text": "Guardians of the Galaxy Vol. 2 (2017). is a Action, Adventure, Comedy movie. Plot: The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage..... Budget: $200M, Revenue: $863M, Rating: 7.6/10. Part of Guardians of the Galaxy Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/283995",
      "title": "Guardians of the Galaxy Vol. 2",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "ScienceFiction"
      ],
      "plot": "The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage.",
      "budget": 200000000.0,
      "release_date": "2017-04-19",
      "rating": 7.6,
      "revenue": 863416141.0,
      "cast": [],
      "collection": "Guardians of the Galaxy Collection"
    }
  },
  {
    "id": "entity_movie_106",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Doctor Strange",
    "text": "Doctor Strange (2016). is a Action, Adventure, Fantasy movie. Plot: After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under his wing and trains him to de.... Budget: $165M, Revenue: $678M, Rating: 7.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/284052",
      "title": "Doctor Strange",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under his wing and trains him to defend the world against evil.",
      "budget": 165000000.0,
      "release_date": "2016-10-25",
      "rating": 7.1,
      "revenue": 677718395.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_107",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Pirates of the Caribbean: At World's End",
    "text": "Pirates of the Caribbean: At World's End (2007). is a Action, Adventure, Fantasy movie. Plot: Captain Barbossa, long believed to be dead, has come back to life and is headed to the edge of the Earth with Will Turner and Elizabeth Swann. But not.... Budget: $300M, Revenue: $961M, Rating: 6.9/10. Part of Pirates of the Caribbean Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/285",
      "title": "Pirates of the Caribbean: At World's End",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Captain Barbossa, long believed to be dead, has come back to life and is headed to the edge of the Earth with Will Turner and Elizabeth Swann. But nothing is quite as it seems.",
      "budget": 300000000.0,
      "release_date": "2007-05-19",
      "rating": 6.9,
      "revenue": 961000000.0,
      "cast": [],
      "collection": "Pirates of the Caribbean Collection"
    }
  },
  {
    "id": "entity_movie_108",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Martian",
    "text": "The Martian (2015). is a Adventure, Drama, ScienceFiction movie. Plot: During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and .... Budget: $108M, Revenue: $630M, Rating: 7.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/286217",
      "title": "The Martian",
      "genres": [
        "Adventure",
        "Drama",
        "ScienceFiction"
      ],
      "plot": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
      "budget": 108000000.0,
      "release_date": "2015-09-30",
      "rating": 7.6,
      "revenue": 630161890.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_109",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Deadpool",
    "text": "Deadpool (2016). is a Action, Adventure, Comedy movie. Plot: Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that .... Budget: $58M, Revenue: $783M, Rating: 7.4/10. Part of Deadpool Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/293660",
      "title": "Deadpool",
      "genres": [
        "Action",
        "Adventure",
        "Comedy"
      ],
      "plot": "Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
      "budget": 58000000.0,
      "release_date": "2016-02-09",
      "rating": 7.4,
      "revenue": 783112979.0,
      "cast": [],
      "collection": "Deadpool Collection"
    }
  },
  {
    "id": "entity_movie_110",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Suicide Squad",
    "text": "Suicide Squad (2016). is a Action, Adventure, Crime movie. Plot: From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, un.... Budget: $175M, Revenue: $746M, Rating: 5.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/297761",
      "title": "Suicide Squad",
      "genres": [
        "Action",
        "Adventure",
        "Crime",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
      "budget": 175000000.0,
      "release_date": "2016-08-02",
      "rating": 5.9,
      "revenue": 745600054.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_111",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Wonder Woman",
    "text": "Wonder Woman (2017). is a Action, Adventure, Fantasy movie. Plot: An Amazon princess comes to the world of Man to become the greatest of the female superheroes..... Budget: $149M, Revenue: $821M, Rating: 7.2/10. Part of Wonder Woman Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/297762",
      "title": "Wonder Woman",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "An Amazon princess comes to the world of Man to become the greatest of the female superheroes.",
      "budget": 149000000.0,
      "release_date": "2017-05-30",
      "rating": 7.2,
      "revenue": 820580447.0,
      "cast": [],
      "collection": "Wonder Woman Collection"
    }
  },
  {
    "id": "entity_movie_112",
    "type": "entity",
    "entity_type": "Movie",
    "title": "La La Land",
    "text": "La La Land (2016). is a Comedy, Drama, Music movie. Plot: Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in .... Budget: $30M, Revenue: $445M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/313369",
      "title": "La La Land",
      "genres": [
        "Comedy",
        "Drama",
        "Music",
        "Romance"
      ],
      "plot": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
      "budget": 30000000.0,
      "release_date": "2016-11-29",
      "rating": 7.9,
      "revenue": 445435700.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_113",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Beauty and the Beast",
    "text": "Beauty and the Beast (2017). is a Family, Fantasy, Romance movie. Plot: A live-action adaptation of Disney's version of the classic 'Beauty and the Beast' tale of a cursed prince and a beautiful young woman who helps him b.... Budget: $160M, Revenue: $1263M, Rating: 6.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/321612",
      "title": "Beauty and the Beast",
      "genres": [
        "Family",
        "Fantasy",
        "Romance"
      ],
      "plot": "A live-action adaptation of Disney's version of the classic 'Beauty and the Beast' tale of a cursed prince and a beautiful young woman who helps him break the spell.",
      "budget": 160000000.0,
      "release_date": "2017-03-16",
      "rating": 6.8,
      "revenue": 1262886337.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_114",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Jurassic Park",
    "text": "Jurassic Park (1993). is a Adventure, ScienceFiction movie. Plot: A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of e.... Budget: $63M, Revenue: $920M, Rating: 7.6/10. Part of Jurassic Park Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/329",
      "title": "Jurassic Park",
      "genres": [
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors. However, the park is anything but amusing as the security systems go off-line and the dinosaurs escape.",
      "budget": 63000000.0,
      "release_date": "1993-06-11",
      "rating": 7.6,
      "revenue": 920100000.0,
      "cast": [],
      "collection": "Jurassic Park Collection"
    }
  },
  {
    "id": "entity_movie_115",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Arrival",
    "text": "Arrival (2016). is a Drama, Mystery, ScienceFiction movie. Plot: Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are .... Budget: $47M, Revenue: $203M, Rating: 7.2/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/329865",
      "title": "Arrival",
      "genres": [
        "Drama",
        "Mystery",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.",
      "budget": 47000000.0,
      "release_date": "2016-11-10",
      "rating": 7.2,
      "revenue": 203388186.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_116",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Rogue One: A Star Wars Story",
    "text": "Rogue One: A Star Wars Story (2016). is a Action, Adventure, ScienceFiction movie. Plot: A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy..... Budget: $200M, Revenue: $1056M, Rating: 7.4/10. Part of Star Wars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/330459",
      "title": "Rogue One: A Star Wars Story",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.",
      "budget": 200000000.0,
      "release_date": "2016-12-14",
      "rating": 7.4,
      "revenue": 1056057273.0,
      "cast": [],
      "collection": "Star Wars Collection"
    }
  },
  {
    "id": "entity_movie_117",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Fate of the Furious",
    "text": "The Fate of the Furious (2017). is a Action, Crime, Thriller movie. Plot: When a mysterious woman seduces Dom into the world of crime and a betrayal of those closest to him, the crew face trials that will test them as never .... Budget: $250M, Revenue: $1239M, Rating: 6.8/10. Part of The Fast and the Furious Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/337339",
      "title": "The Fate of the Furious",
      "genres": [
        "Action",
        "Crime",
        "Thriller"
      ],
      "plot": "When a mysterious woman seduces Dom into the world of crime and a betrayal of those closest to him, the crew face trials that will test them as never before.",
      "budget": 250000000.0,
      "release_date": "2017-04-12",
      "rating": 6.8,
      "revenue": 1238764765.0,
      "cast": [],
      "collection": "The Fast and the Furious Collection"
    }
  },
  {
    "id": "entity_movie_118",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Alien",
    "text": "Alien (1979). is a Action, Horror, ScienceFiction movie. Plot: During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew.... Budget: $11M, Revenue: $105M, Rating: 7.9/10. Part of Alien Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/348",
      "title": "Alien",
      "genres": [
        "Action",
        "Horror",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.",
      "budget": 11000000.0,
      "release_date": "1979-05-25",
      "rating": 7.9,
      "revenue": 104931801.0,
      "cast": [],
      "collection": "Alien Collection"
    }
  },
  {
    "id": "entity_movie_119",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Casino Royale",
    "text": "Casino Royale (2006). is a Action, Adventure, Thriller movie. Plot: Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his win.... Budget: $150M, Revenue: $599M, Rating: 7.3/10. Part of James Bond Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/36557",
      "title": "Casino Royale",
      "genres": [
        "Action",
        "Adventure",
        "Thriller"
      ],
      "plot": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond – on his maiden mission as a 00 Agent – to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
      "budget": 150000000.0,
      "release_date": "2006-11-14",
      "rating": 7.3,
      "revenue": 599045960.0,
      "cast": [],
      "collection": "James Bond Collection"
    }
  },
  {
    "id": "entity_movie_120",
    "type": "entity",
    "entity_type": "Movie",
    "title": "X-Men",
    "text": "X-Men (2000). is a Action, Adventure, ScienceFiction movie. Plot: Two mutants, Rogue and Wolverine, come to a private academy for their kind whose resident superhero team, the X-Men, must oppose a terrorist organizat.... Budget: $75M, Revenue: $296M, Rating: 6.8/10. Part of X-Men Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/36657",
      "title": "X-Men",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Two mutants, Rogue and Wolverine, come to a private academy for their kind whose resident superhero team, the X-Men, must oppose a terrorist organization with similar powers.",
      "budget": 75000000.0,
      "release_date": "2000-07-13",
      "rating": 6.8,
      "revenue": 296339527.0,
      "cast": [],
      "collection": "X-Men Collection"
    }
  },
  {
    "id": "entity_movie_121",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Truman Show",
    "text": "The Truman Show (1998). is a Comedy, Drama movie. Plot: Truman Burbank is the star of \"The Truman Show\", a 24-hour-a-day \"reality\" TV show that broadcasts every aspect of his life -- live and in color -- wi.... Budget: $60M, Revenue: $264M, Rating: 7.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/37165",
      "title": "The Truman Show",
      "genres": [
        "Comedy",
        "Drama"
      ],
      "plot": "Truman Burbank is the star of \"The Truman Show\", a 24-hour-a-day \"reality\" TV show that broadcasts every aspect of his life -- live and in color -- without his knowledge. His entire life has been an unending soap opera for consumption by the rest of the world. And everyone he knows -- including his wife and his best friend -- is really an actor, paid to be part of his life.",
      "budget": 60000000.0,
      "release_date": "1998-06-04",
      "rating": 7.8,
      "revenue": 264118201.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_122",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Skyfall",
    "text": "Skyfall (2012). is a Action, Adventure, Thriller movie. Plot: When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These even.... Budget: $200M, Revenue: $1109M, Rating: 6.9/10. Part of James Bond Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/37724",
      "title": "Skyfall",
      "genres": [
        "Action",
        "Adventure",
        "Thriller"
      ],
      "plot": "When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory, the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve - following a trail to the mysterious Silva, whose lethal and hidden motives have yet to reveal themselves.",
      "budget": 200000000.0,
      "release_date": "2012-10-25",
      "rating": 6.9,
      "revenue": 1108561013.0,
      "cast": [],
      "collection": "James Bond Collection"
    }
  },
  {
    "id": "entity_movie_123",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Split",
    "text": "Split (2016). is a Horror, Thriller movie. Plot: Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and.... Budget: $9M, Revenue: $277M, Rating: 7.0/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/381288",
      "title": "Split",
      "genres": [
        "Horror",
        "Thriller"
      ],
      "plot": "Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.",
      "budget": 9000000.0,
      "release_date": "2016-11-15",
      "rating": 7.0,
      "revenue": 276921998.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_124",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Kill Bill: Vol. 2",
    "text": "Kill Bill: Vol. 2 (2004). is a Action, Crime, Thriller movie. Plot: The Bride unwaveringly continues on her roaring rampage of revenge against the band of assassins who had tried to kill her and her unborn child. She v.... Budget: $30M, Revenue: $152M, Rating: 7.7/10. Part of Kill Bill Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/393",
      "title": "Kill Bill: Vol. 2",
      "genres": [
        "Action",
        "Crime",
        "Thriller"
      ],
      "plot": "The Bride unwaveringly continues on her roaring rampage of revenge against the band of assassins who had tried to kill her and her unborn child. She visits each of her former associates one-by-one, checking off the victims on her Death List Five until there's nothing left to do … but kill Bill.",
      "budget": 30000000.0,
      "release_date": "2004-04-16",
      "rating": 7.7,
      "revenue": 152159461.0,
      "cast": [],
      "collection": "Kill Bill Collection"
    }
  },
  {
    "id": "entity_movie_125",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Men in Black 3",
    "text": "Men in Black 3 (2012). is a Action, Comedy, ScienceFiction movie. Plot: Agents J (Will Smith) and K (Tommy Lee Jones) are back...in time. J has seen some inexplicable things in his 15 years with the Men in Black, but nothi.... Budget: $225M, Revenue: $624M, Rating: 6.3/10. Part of Men In Black Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/41154",
      "title": "Men in Black 3",
      "genres": [
        "Action",
        "Comedy",
        "ScienceFiction"
      ],
      "plot": "Agents J (Will Smith) and K (Tommy Lee Jones) are back...in time. J has seen some inexplicable things in his 15 years with the Men in Black, but nothing, not even aliens, perplexes him as much as his wry, reticent partner. But when K's life and the fate of the planet are put at stake, Agent J will have to travel back in time to put things right. J discovers that there are secrets to the universe that K never told him - secrets that will reveal themselves as he teams up with the young Agent K (Josh Brolin) to save his partner, the agency, and the future of humankind.",
      "budget": 225000000.0,
      "release_date": "2012-05-23",
      "rating": 6.3,
      "revenue": 624026776.0,
      "cast": [],
      "collection": "Men In Black Collection"
    }
  },
  {
    "id": "entity_movie_126",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Schindler's List",
    "text": "Schindler's List (1993). is a Drama, History, War movie. Plot: The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during .... Budget: $22M, Revenue: $321M, Rating: 8.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/424",
      "title": "Schindler's List",
      "genres": [
        "Drama",
        "History",
        "War"
      ],
      "plot": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
      "budget": 22000000.0,
      "release_date": "1993-11-29",
      "rating": 8.3,
      "revenue": 321365567.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_127",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Ice Age",
    "text": "Ice Age (2002). is a Adventure, Animation, Comedy movie. Plot: With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and S.... Budget: $59M, Revenue: $383M, Rating: 7.1/10. Part of Ice Age Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/425",
      "title": "Ice Age",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.",
      "budget": 59000000.0,
      "release_date": "2002-03-10",
      "rating": 7.1,
      "revenue": 383257136.0,
      "cast": [],
      "collection": "Ice Age Collection"
    }
  },
  {
    "id": "entity_movie_128",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Black Swan",
    "text": "Black Swan (2010). is a Drama, Thriller movie. Plot: A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as s.... Budget: $13M, Revenue: $328M, Rating: 7.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/44214",
      "title": "Black Swan",
      "genres": [
        "Drama",
        "Thriller"
      ],
      "plot": "A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odile, the Black Swan.",
      "budget": 13000000.0,
      "release_date": "2010-12-02",
      "rating": 7.3,
      "revenue": 327803731.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_129",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hangover Part II",
    "text": "The Hangover Part II (2011). is a Comedy movie. Plot: The Hangover crew heads to Thailand for Stu's wedding. After the disaster of a bachelor party in Las Vegas last year, Stu is playing it safe with a me.... Budget: $80M, Revenue: $254M, Rating: 6.2/10. Part of The Hangover Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/45243",
      "title": "The Hangover Part II",
      "genres": [
        "Comedy"
      ],
      "plot": "The Hangover crew heads to Thailand for Stu's wedding. After the disaster of a bachelor party in Las Vegas last year, Stu is playing it safe with a mellow pre-wedding brunch. However, nothing goes as planned and Bangkok is the perfect setting for another adventure with the rowdy group.",
      "budget": 80000000.0,
      "release_date": "2011-05-25",
      "rating": 6.2,
      "revenue": 254455986.0,
      "cast": [],
      "collection": "The Hangover Collection"
    }
  },
  {
    "id": "entity_movie_130",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Dark Knight Rises",
    "text": "The Dark Knight Rises (2012). is a Action, Crime, Drama movie. Plot: Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is.... Budget: $250M, Revenue: $1085M, Rating: 7.6/10. Part of The Dark Knight Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/49026",
      "title": "The Dark Knight Rises",
      "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
      ],
      "plot": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
      "budget": 250000000.0,
      "release_date": "2012-07-16",
      "rating": 7.6,
      "revenue": 1084939099.0,
      "cast": [],
      "collection": "The Dark Knight Collection"
    }
  },
  {
    "id": "entity_movie_131",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Gravity",
    "text": "Gravity (2013). is a Drama, ScienceFiction, Thriller movie. Plot: Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before r.... Budget: $105M, Revenue: $716M, Rating: 7.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/49047",
      "title": "Gravity",
      "genres": [
        "Drama",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Dr. Ryan Stone, a brilliant medical engineer on her first Shuttle mission, with veteran astronaut Matt Kowalsky in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The Shuttle is destroyed, leaving Stone and Kowalsky completely alone-tethered to nothing but each other and spiraling out into the blackness of space. The deafening silence tells them they have lost any link to Earth and any chance for rescue. As fear turns to panic, every gulp of air eats away at what little oxygen is left. But the only way home may be to go further out into the terrifying expanse of space.",
      "budget": 105000000.0,
      "release_date": "2013-09-27",
      "rating": 7.3,
      "revenue": 716392705.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_132",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hobbit: An Unexpected Journey",
    "text": "The Hobbit: An Unexpected Journey (2012). is a Action, Adventure, Fantasy movie. Plot: Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mounta.... Budget: $250M, Revenue: $1021M, Rating: 7.0/10. Part of The Hobbit Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/49051",
      "title": "The Hobbit: An Unexpected Journey",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
      "budget": 250000000.0,
      "release_date": "2012-11-26",
      "rating": 7.0,
      "revenue": 1021103568.0,
      "cast": [],
      "collection": "The Hobbit Collection"
    }
  },
  {
    "id": "entity_movie_133",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Man of Steel",
    "text": "Man of Steel (2013). is a Action, Adventure, Fantasy movie. Plot: A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he w.... Budget: $225M, Revenue: $663M, Rating: 6.5/10. Part of Man of Steel Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/49521",
      "title": "Man of Steel",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "A young boy learns that he has extraordinary powers and is not of this earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.",
      "budget": 225000000.0,
      "release_date": "2013-06-12",
      "rating": 6.5,
      "revenue": 662845518.0,
      "cast": [],
      "collection": "Man of Steel Collection"
    }
  },
  {
    "id": "entity_movie_134",
    "type": "entity",
    "entity_type": "Movie",
    "title": "X-Men: First Class",
    "text": "X-Men: First Class (2011). is a Action, Adventure, ScienceFiction movie. Plot: Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. B.... Budget: $160M, Revenue: $354M, Rating: 7.1/10. Part of X-Men Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/49538",
      "title": "X-Men: First Class",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were arch-enemies, they were closest of friends, working together with other mutants (some familiar, some new), to stop the greatest threat the world has ever known.",
      "budget": 160000000.0,
      "release_date": "2011-05-24",
      "rating": 7.1,
      "revenue": 353624124.0,
      "cast": [],
      "collection": "X-Men Collection"
    }
  },
  {
    "id": "entity_movie_135",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Green Mile",
    "text": "The Green Mile (1999). is a Crime, Drama, Fantasy movie. Plot: A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. Wh.... Budget: $60M, Revenue: $285M, Rating: 8.2/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/497",
      "title": "The Green Mile",
      "genres": [
        "Crime",
        "Drama",
        "Fantasy"
      ],
      "plot": "A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the cellblock's head guard, Paul Edgecomb, recognizes Coffey's miraculous gift, he tries desperately to help stave off the condemned man's execution.",
      "budget": 60000000.0,
      "release_date": "1999-12-10",
      "rating": 8.2,
      "revenue": 284600000.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_136",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Reservoir Dogs",
    "text": "Reservoir Dogs (1992). is a Crime, Thriller movie. Plot: A botched robbery indicates a police informant, and the pressure mounts in the aftermath at a warehouse. Crime begets violence as the survivors -- vet.... Budget: $1M, Revenue: $15M, Rating: 8.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/500",
      "title": "Reservoir Dogs",
      "genres": [
        "Crime",
        "Thriller"
      ],
      "plot": "A botched robbery indicates a police informant, and the pressure mounts in the aftermath at a warehouse. Crime begets violence as the survivors -- veteran Mr. White, newcomer Mr. Orange, psychopathic parolee Mr. Blonde, bickering weasel Mr. Pink and Nice Guy Eddie -- unravel.",
      "budget": 1200000.0,
      "release_date": "1992-09-02",
      "rating": 8.1,
      "revenue": 14661007.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_137",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Limitless",
    "text": "Limitless (2011). is a Mystery, ScienceFiction, Thriller movie. Plot: A paranoia-fueled action thriller about an unsuccessful writer whose life is transformed by a top-secret \"smart drug\" that allows him to use 100% of h.... Budget: $27M, Revenue: $162M, Rating: 7.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/51876",
      "title": "Limitless",
      "genres": [
        "Mystery",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "A paranoia-fueled action thriller about an unsuccessful writer whose life is transformed by a top-secret \"smart drug\" that allows him to use 100% of his brain and become a perfect version of himself. His enhanced abilities soon attract shadowy forces that threaten his new life in this darkly comic and provocative film.",
      "budget": 27000000.0,
      "release_date": "2011-03-08",
      "rating": 7.1,
      "revenue": 161849455.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_138",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Star Trek Into Darkness",
    "text": "Star Trek Into Darkness (2013). is a Action, Adventure, ScienceFiction movie. Plot: When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fle.... Budget: $190M, Revenue: $467M, Rating: 7.4/10. Part of Star Trek: Alternate Reality Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/54138",
      "title": "Star Trek Into Darkness",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
      "budget": 190000000.0,
      "release_date": "2013-05-05",
      "rating": 7.4,
      "revenue": 467365246.0,
      "cast": [],
      "collection": "Star Trek: Alternate Reality Collection"
    }
  },
  {
    "id": "entity_movie_139",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Fight Club",
    "text": "Fight Club (1999). is a Drama movie. Plot: A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches o.... Budget: $63M, Revenue: $101M, Rating: 8.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/550",
      "title": "Fight Club",
      "genres": [
        "Drama"
      ],
      "plot": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
      "budget": 63000000.0,
      "release_date": "1999-10-15",
      "rating": 8.3,
      "revenue": 100853753.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_140",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Spider-Man",
    "text": "Spider-Man (2002). is a Action, Fantasy movie. Plot: After being bitten by a genetically altered spider, nerdy high school student Peter Parker is endowed with amazing powers..... Budget: $139M, Revenue: $822M, Rating: 6.8/10. Part of Spider-Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/557",
      "title": "Spider-Man",
      "genres": [
        "Action",
        "Fantasy"
      ],
      "plot": "After being bitten by a genetically altered spider, nerdy high school student Peter Parker is endowed with amazing powers.",
      "budget": 139000000.0,
      "release_date": "2002-05-01",
      "rating": 6.8,
      "revenue": 821708551.0,
      "cast": [],
      "collection": "Spider-Man Collection"
    }
  },
  {
    "id": "entity_movie_141",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Spider-Man 2",
    "text": "Spider-Man 2 (2004). is a Action, Adventure, Fantasy movie. Plot: Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves th.... Budget: $200M, Revenue: $784M, Rating: 6.7/10. Part of Spider-Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/558",
      "title": "Spider-Man 2",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood.",
      "budget": 200000000.0,
      "release_date": "2004-06-25",
      "rating": 6.7,
      "revenue": 783766341.0,
      "cast": [],
      "collection": "Spider-Man Collection"
    }
  },
  {
    "id": "entity_movie_142",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Die Hard",
    "text": "Die Hard (1988). is a Action, Thriller movie. Plot: NYPD cop, John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when minutes after he arrives at her office, the entir.... Budget: $28M, Revenue: $141M, Rating: 7.5/10. Part of Die Hard Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/562",
      "title": "Die Hard",
      "genres": [
        "Action",
        "Thriller"
      ],
      "plot": "NYPD cop, John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when minutes after he arrives at her office, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.",
      "budget": 28000000.0,
      "release_date": "1988-07-15",
      "rating": 7.5,
      "revenue": 140767956.0,
      "cast": [],
      "collection": "Die Hard Collection"
    }
  },
  {
    "id": "entity_movie_143",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Mission: Impossible - Ghost Protocol",
    "text": "Mission: Impossible - Ghost Protocol (2011). is a Action, Adventure, Thriller movie. Plot: In the 4th installment of the Mission Impossible series, Ethan Hunt (Cruise) and his team are racing against time to track down a dangerous terrorist .... Budget: $145M, Revenue: $695M, Rating: 6.8/10. Part of Mission: Impossible Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/56292",
      "title": "Mission: Impossible - Ghost Protocol",
      "genres": [
        "Action",
        "Adventure",
        "Thriller"
      ],
      "plot": "In the 4th installment of the Mission Impossible series, Ethan Hunt (Cruise) and his team are racing against time to track down a dangerous terrorist named Hendricks (Nyqvist), who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.",
      "budget": 145000000.0,
      "release_date": "2011-12-07",
      "rating": 6.8,
      "revenue": 694713380.0,
      "cast": [],
      "collection": "Mission: Impossible Collection"
    }
  },
  {
    "id": "entity_movie_144",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hobbit: The Desolation of Smaug",
    "text": "The Hobbit: The Desolation of Smaug (2013). is a Adventure, Fantasy movie. Plot: The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to ge.... Budget: $250M, Revenue: $958M, Rating: 7.6/10. Part of The Hobbit Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/57158",
      "title": "The Hobbit: The Desolation of Smaug",
      "genres": [
        "Adventure",
        "Fantasy"
      ],
      "plot": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
      "budget": 250000000.0,
      "release_date": "2013-12-11",
      "rating": 7.6,
      "revenue": 958400000.0,
      "cast": [],
      "collection": "The Hobbit Collection"
    }
  },
  {
    "id": "entity_movie_145",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Pirates of the Caribbean: Dead Man's Chest",
    "text": "Pirates of the Caribbean: Dead Man's Chest (2006). is a Action, Adventure, Fantasy movie. Plot: Captain Jack Sparrow works his way out of a blood debt with the ghostly Davey Jones, he also attempts to avoid eternal damnation..... Budget: $200M, Revenue: $1066M, Rating: 7.0/10. Part of Pirates of the Caribbean Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/58",
      "title": "Pirates of the Caribbean: Dead Man's Chest",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Captain Jack Sparrow works his way out of a blood debt with the ghostly Davey Jones, he also attempts to avoid eternal damnation.",
      "budget": 200000000.0,
      "release_date": "2006-06-20",
      "rating": 7.0,
      "revenue": 1065659812.0,
      "cast": [],
      "collection": "Pirates of the Caribbean Collection"
    }
  },
  {
    "id": "entity_movie_146",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Monsters, Inc.",
    "text": "Monsters, Inc. (2001). is a Animation, Comedy, Family movie. Plot: James Sullivan and Mike Wazowski are monsters, they earn their living scaring children and are the best in the business... even though they're more af.... Budget: $115M, Revenue: $563M, Rating: 7.5/10. Part of Monsters, Inc. Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/585",
      "title": "Monsters, Inc.",
      "genres": [
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "James Sullivan and Mike Wazowski are monsters, they earn their living scaring children and are the best in the business... even though they're more afraid of the children than they are of them. When a child accidentally enters their world, James and Mike suddenly find that kids are not to be afraid of and they uncover a conspiracy that could threaten all children across the world.",
      "budget": 115000000.0,
      "release_date": "2001-11-01",
      "rating": 7.5,
      "revenue": 562816256.0,
      "cast": [],
      "collection": "Monsters, Inc. Collection"
    }
  },
  {
    "id": "entity_movie_147",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Sherlock Holmes: A Game of Shadows",
    "text": "Sherlock Holmes: A Game of Shadows (2011). is a Action, Adventure, Crime movie. Plot: There is a new criminal mastermind at large (Professor Moriarty) and not only is he Holmes’ intellectual equal, but his capacity for evil and lack of .... Budget: $125M, Revenue: $335M, Rating: 7.0/10. Part of Sherlock Holmes Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/58574",
      "title": "Sherlock Holmes: A Game of Shadows",
      "genres": [
        "Action",
        "Adventure",
        "Crime",
        "Mystery"
      ],
      "plot": "There is a new criminal mastermind at large (Professor Moriarty) and not only is he Holmes’ intellectual equal, but his capacity for evil and lack of conscience may give him an advantage over the  detective.",
      "budget": 125000000.0,
      "release_date": "2011-11-22",
      "rating": 7.0,
      "revenue": 334615000.0,
      "cast": [],
      "collection": "Sherlock Holmes Collection"
    }
  },
  {
    "id": "entity_movie_148",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Titanic",
    "text": "Titanic (1997). is a Drama, Romance, Thriller movie. Plot: 84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby B.... Budget: $200M, Revenue: $1845M, Rating: 7.5/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/597",
      "title": "Titanic",
      "genres": [
        "Drama",
        "Romance",
        "Thriller"
      ],
      "plot": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
      "budget": 200000000.0,
      "release_date": "1997-11-18",
      "rating": 7.5,
      "revenue": 1845034188.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_149",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Looper",
    "text": "Looper (2012). is a Action, ScienceFiction, Thriller movie. Plot: In the futuristic action thriller Looper, time travel will be invented but it will be illegal and only available on the black market. When the mob wan.... Budget: $30M, Revenue: $47M, Rating: 6.6/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/59967",
      "title": "Looper",
      "genres": [
        "Action",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "In the futuristic action thriller Looper, time travel will be invented but it will be illegal and only available on the black market. When the mob wants to get rid of someone, they will send their target 30 years into the past where a looper, a hired gun, like Joe is waiting to mop up. Joe is getting rich and life is good until the day the mob decides to close the loop, sending back Joe's future self for assassination.",
      "budget": 30000000.0,
      "release_date": "2012-09-26",
      "rating": 6.6,
      "revenue": 47042000.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_150",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Matrix",
    "text": "The Matrix (1999). is a Action, ScienceFiction movie. Plot: Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful co.... Budget: $63M, Revenue: $464M, Rating: 7.9/10. Part of The Matrix Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/603",
      "title": "The Matrix",
      "genres": [
        "Action",
        "ScienceFiction"
      ],
      "plot": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
      "budget": 63000000.0,
      "release_date": "1999-03-30",
      "rating": 7.9,
      "revenue": 463517383.0,
      "cast": [],
      "collection": "The Matrix Collection"
    }
  },
  {
    "id": "entity_movie_151",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Men in Black",
    "text": "Men in Black (1997). is a Action, Adventure, Comedy movie. Plot: Men in Black follows the exploits of agents Kay and Jay, members of a top-secret organization established to monitor and police alien activity on Eart.... Budget: $90M, Revenue: $589M, Rating: 6.9/10. Part of Men In Black Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/607",
      "title": "Men in Black",
      "genres": [
        "Action",
        "Adventure",
        "Comedy",
        "ScienceFiction"
      ],
      "plot": "Men in Black follows the exploits of agents Kay and Jay, members of a top-secret organization established to monitor and police alien activity on Earth. The two Men in Black find themselves in the middle of the deadly plot by an intergalactic terrorist who has arrived on Earth to assassinate two ambassadors from opposing galaxies. In order to prevent worlds from colliding, the MiB must track down the terrorist and prevent the destruction of Earth. It's just another typical day for the Men in Black.",
      "budget": 90000000.0,
      "release_date": "1997-07-02",
      "rating": 6.9,
      "revenue": 589390539.0,
      "cast": [],
      "collection": "Men In Black Collection"
    }
  },
  {
    "id": "entity_movie_152",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Rise of the Planet of the Apes",
    "text": "Rise of the Planet of the Apes (2011). is a Action, Drama, ScienceFiction movie. Plot: Scientist Will Rodman is determined to find a cure for Alzheimer's, the disease which has slowly consumed his father. Will feels certain he is close t.... Budget: $93M, Revenue: $483M, Rating: 7.0/10. Part of Planet of the Apes (Reboot) Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/61791",
      "title": "Rise of the Planet of the Apes",
      "genres": [
        "Action",
        "Drama",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Scientist Will Rodman is determined to find a cure for Alzheimer's, the disease which has slowly consumed his father. Will feels certain he is close to a breakthrough and tests his latest serum on apes, noticing dramatic increases in intelligence and brain activity in the primate subjects – especially Caesar, his pet chimpanzee.",
      "budget": 93000000.0,
      "release_date": "2011-08-03",
      "rating": 7.0,
      "revenue": 482860185.0,
      "cast": [],
      "collection": "Planet of the Apes (Reboot) Collection"
    }
  },
  {
    "id": "entity_movie_153",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Brave",
    "text": "Brave (2012). is a Action, Adventure, Animation movie. Plot: Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter a.... Budget: $185M, Revenue: $539M, Rating: 6.7/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/62177",
      "title": "Brave",
      "genres": [
        "Action",
        "Adventure",
        "Animation",
        "Comedy",
        "Family",
        "Fantasy"
      ],
      "plot": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
      "budget": 185000000.0,
      "release_date": "2012-06-21",
      "rating": 6.7,
      "revenue": 538983207.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_154",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Catch Me If You Can",
    "text": "Catch Me If You Can (2002). is a Crime, Drama movie. Plot: A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor.... Budget: $52M, Revenue: $352M, Rating: 7.7/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/640",
      "title": "Catch Me If You Can",
      "genres": [
        "Crime",
        "Drama"
      ],
      "plot": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.",
      "budget": 52000000.0,
      "release_date": "2002-12-25",
      "rating": 7.7,
      "revenue": 352114312.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_155",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Great Gatsby",
    "text": "The Great Gatsby (2013). is a Drama, Romance movie. Plot: An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gat.... Budget: $105M, Revenue: $351M, Rating: 7.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/64682",
      "title": "The Great Gatsby",
      "genres": [
        "Drama",
        "Romance"
      ],
      "plot": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.",
      "budget": 105000000.0,
      "release_date": "2013-05-10",
      "rating": 7.3,
      "revenue": 351040419.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_156",
    "type": "entity",
    "entity_type": "Movie",
    "title": "21 Jump Street",
    "text": "21 Jump Street (2012). is a Action, Comedy, Crime movie. Plot: In high school, Schmidt was a dork and Jenko was the popular jock. After graduation, both of them joined the police force and ended up as partners rid.... Budget: $42M, Revenue: $202M, Rating: 6.7/10. Part of Jump Street Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/64688",
      "title": "21 Jump Street",
      "genres": [
        "Action",
        "Comedy",
        "Crime"
      ],
      "plot": "In high school, Schmidt was a dork and Jenko was the popular jock. After graduation, both of them joined the police force and ended up as partners riding bicycles in the city park. Since they are young and look like high school students, they are assigned to an undercover unit to infiltrate a drug ring that is supplying high school students synthetic drugs.",
      "budget": 42000000.0,
      "release_date": "2012-03-12",
      "rating": 6.7,
      "revenue": 201585328.0,
      "cast": [],
      "collection": "Jump Street Collection"
    }
  },
  {
    "id": "entity_movie_157",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Drive",
    "text": "Drive (2011). is a Action, Crime, Drama movie. Plot: A Hollywood stunt performer who moonlights as a wheelman for criminals discovers that a contract has been put on him after a heist gone wrong..... Budget: $15M, Revenue: $78M, Rating: 7.4/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/64690",
      "title": "Drive",
      "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
      ],
      "plot": "A Hollywood stunt performer who moonlights as a wheelman for criminals discovers that a contract has been put on him after a heist gone wrong.",
      "budget": 15000000.0,
      "release_date": "2011-08-06",
      "rating": 7.4,
      "revenue": 78054825.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_158",
    "type": "entity",
    "entity_type": "Movie",
    "title": "I Am Legend",
    "text": "I Am Legend (2007). is a Action, Drama, Horror movie. Plot: Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last.... Budget: $150M, Revenue: $585M, Rating: 6.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/6479",
      "title": "I Am Legend",
      "genres": [
        "Action",
        "Drama",
        "Horror",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
      "budget": 150000000.0,
      "release_date": "2007-12-14",
      "rating": 6.9,
      "revenue": 585349010.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_159",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Philosopher's Stone",
    "text": "Harry Potter and the Philosopher's Stone (2001). is a Adventure, Family, Fantasy movie. Plot: Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- wi.... Budget: $125M, Revenue: $976M, Rating: 7.5/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/671",
      "title": "Harry Potter and the Philosopher's Stone",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths -- and about the villain who's to blame.",
      "budget": 125000000.0,
      "release_date": "2001-11-16",
      "rating": 7.5,
      "revenue": 976475550.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_160",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Chamber of Secrets",
    "text": "Harry Potter and the Chamber of Secrets (2002). is a Adventure, Family, Fantasy movie. Plot: Ignoring threats to his life, Harry returns to Hogwarts to investigate – aided by Ron and Hermione – a mysterious series of attacks..... Budget: $100M, Revenue: $877M, Rating: 7.4/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/672",
      "title": "Harry Potter and the Chamber of Secrets",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Ignoring threats to his life, Harry returns to Hogwarts to investigate – aided by Ron and Hermione – a mysterious series of attacks.",
      "budget": 100000000.0,
      "release_date": "2002-11-13",
      "rating": 7.4,
      "revenue": 876688482.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_161",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Prisoner of Azkaban",
    "text": "Harry Potter and the Prisoner of Azkaban (2004). is a Adventure, Family, Fantasy movie. Plot: Harry, Ron and Hermione return to Hogwarts for another magic-filled year. Harry comes face to face with danger yet again, this time in the form of esc.... Budget: $130M, Revenue: $790M, Rating: 7.7/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/673",
      "title": "Harry Potter and the Prisoner of Azkaban",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Harry, Ron and Hermione return to Hogwarts for another magic-filled year. Harry comes face to face with danger yet again, this time in the form of escaped convict, Sirius Black – and turns to sympathetic Professor Lupin for help.",
      "budget": 130000000.0,
      "release_date": "2004-05-31",
      "rating": 7.7,
      "revenue": 789804554.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_162",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Goblet of Fire",
    "text": "Harry Potter and the Goblet of Fire (2005). is a Adventure, Family, Fantasy movie. Plot: Harry starts his fourth year at Hogwarts, competes in the treacherous Triwizard Tournament and faces the evil Lord Voldemort. Ron and Hermione help Ha.... Budget: $150M, Revenue: $896M, Rating: 7.5/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/674",
      "title": "Harry Potter and the Goblet of Fire",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "Harry starts his fourth year at Hogwarts, competes in the treacherous Triwizard Tournament and faces the evil Lord Voldemort. Ron and Hermione help Harry manage the pressure – but Voldemort lurks, awaiting his chance to destroy Harry and all that he stands for.",
      "budget": 150000000.0,
      "release_date": "2005-11-05",
      "rating": 7.5,
      "revenue": 895921036.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_163",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Order of the Phoenix",
    "text": "Harry Potter and the Order of the Phoenix (2007). is a Adventure, Family, Fantasy movie. Plot: Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Le.... Budget: $150M, Revenue: $938M, Rating: 7.4/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/675",
      "title": "Harry Potter and the Order of the Phoenix",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy",
        "Mystery"
      ],
      "plot": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students – dubbed 'Dumbledore's Army' – to defend themselves against the dark arts.",
      "budget": 150000000.0,
      "release_date": "2007-06-28",
      "rating": 7.4,
      "revenue": 938212738.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_164",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Pulp Fiction",
    "text": "Pulp Fiction (1994). is a Crime, Thriller movie. Plot: A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime cape.... Budget: $8M, Revenue: $214M, Rating: 8.3/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/680",
      "title": "Pulp Fiction",
      "genres": [
        "Crime",
        "Thriller"
      ],
      "plot": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
      "budget": 8000000.0,
      "release_date": "1994-09-10",
      "rating": 8.3,
      "revenue": 213928762.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_165",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Django Unchained",
    "text": "Django Unchained (2012). is a Drama, Western movie. Plot: With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner..... Budget: $100M, Revenue: $425M, Rating: 7.8/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/68718",
      "title": "Django Unchained",
      "genres": [
        "Drama",
        "Western"
      ],
      "plot": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
      "budget": 100000000.0,
      "release_date": "2012-12-25",
      "rating": 7.8,
      "revenue": 425368238.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_166",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Iron Man 3",
    "text": "Iron Man 3 (2013). is a Action, Adventure, ScienceFiction movie. Plot: When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution..... Budget: $200M, Revenue: $1215M, Rating: 6.8/10. Part of Iron Man Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/68721",
      "title": "Iron Man 3",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
      "budget": 200000000.0,
      "release_date": "2013-04-18",
      "rating": 6.8,
      "revenue": 1215439994.0,
      "cast": [],
      "collection": "Iron Man Collection"
    }
  },
  {
    "id": "entity_movie_167",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Pacific Rim",
    "text": "Pacific Rim (2013). is a Action, Adventure, ScienceFiction movie. Plot: When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's.... Budget: $180M, Revenue: $408M, Rating: 6.7/10. Part of Pacific Rim Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/68726",
      "title": "Pacific Rim",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes—a washed-up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi)—who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.",
      "budget": 180000000.0,
      "release_date": "2013-07-11",
      "rating": 6.7,
      "revenue": 407602906.0,
      "cast": [],
      "collection": "Pacific Rim Collection"
    }
  },
  {
    "id": "entity_movie_168",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Shining",
    "text": "The Shining (1980). is a Horror, Thriller movie. Plot: Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest.... Budget: $19M, Revenue: $44M, Rating: 8.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/694",
      "title": "The Shining",
      "genres": [
        "Horror",
        "Thriller"
      ],
      "plot": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
      "budget": 19000000.0,
      "release_date": "1980-05-22",
      "rating": 8.1,
      "revenue": 44017374.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_169",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Hunger Games",
    "text": "The Hunger Games (2012). is a Adventure, Fantasy, ScienceFiction movie. Plot: Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to comp.... Budget: $75M, Revenue: $691M, Rating: 6.9/10. Part of The Hunger Games Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/70160",
      "title": "The Hunger Games",
      "genres": [
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
      "budget": 75000000.0,
      "release_date": "2012-03-12",
      "rating": 6.9,
      "revenue": 691210692.0,
      "cast": [],
      "collection": "The Hunger Games Collection"
    }
  },
  {
    "id": "entity_movie_170",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Prometheus",
    "text": "Prometheus (2012). is a Adventure, Mystery, ScienceFiction movie. Plot: A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they .... Budget: $130M, Revenue: $403M, Rating: 6.3/10. Part of Prometheus Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/70981",
      "title": "Prometheus",
      "genres": [
        "Adventure",
        "Mystery",
        "ScienceFiction"
      ],
      "plot": "A team of explorers discover a clue to the origins of mankind on Earth, leading them on a journey to the darkest corners of the universe. There, they must fight a terrifying battle to save the future of the human race.",
      "budget": 130000000.0,
      "release_date": "2012-05-30",
      "rating": 6.3,
      "revenue": 403170142.0,
      "cast": [],
      "collection": "Prometheus Collection"
    }
  },
  {
    "id": "entity_movie_171",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Ted",
    "text": "Ted (2012). is a Comedy, Fantasy movie. Plot: John Bennett, a man whose childhood wish of bringing his teddy bear to life came true, now must decide between keeping the relationship with the bear .... Budget: $50M, Revenue: $549M, Rating: 6.3/10. Part of Ted Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/72105",
      "title": "Ted",
      "genres": [
        "Comedy",
        "Fantasy"
      ],
      "plot": "John Bennett, a man whose childhood wish of bringing his teddy bear to life came true, now must decide between keeping the relationship with the bear or his girlfriend, Lori.",
      "budget": 50000000.0,
      "release_date": "2012-06-29",
      "rating": 6.3,
      "revenue": 549368315.0,
      "cast": [],
      "collection": "Ted Collection"
    }
  },
  {
    "id": "entity_movie_172",
    "type": "entity",
    "entity_type": "Movie",
    "title": "World War Z",
    "text": "World War Z (2013). is a Action, Drama, Horror movie. Plot: Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning .... Budget: $200M, Revenue: $532M, Rating: 6.7/10. Part of World War Z Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/72190",
      "title": "World War Z",
      "genres": [
        "Action",
        "Drama",
        "Horror",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls.",
      "budget": 200000000.0,
      "release_date": "2013-06-20",
      "rating": 6.7,
      "revenue": 531865000.0,
      "cast": [],
      "collection": "World War Z Collection"
    }
  },
  {
    "id": "entity_movie_173",
    "type": "entity",
    "entity_type": "Movie",
    "title": "V for Vendetta",
    "text": "V for Vendetta (2006). is a Action, Fantasy, Thriller movie. Plot: In a world in which Great Britain has become a fascist state, a masked vigilante known only as 'V' conducts guerrilla warfare against the oppressive B.... Budget: $54M, Revenue: $133M, Rating: 7.7/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/752",
      "title": "V for Vendetta",
      "genres": [
        "Action",
        "Fantasy",
        "Thriller"
      ],
      "plot": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as 'V' conducts guerrilla warfare against the oppressive British government. When 'V' rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
      "budget": 54000000.0,
      "release_date": "2006-03-15",
      "rating": 7.7,
      "revenue": 132511035.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_174",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Oblivion",
    "text": "Oblivion (2013). is a Action, Adventure, Mystery movie. Plot: Jack Harper is one of the last few drone repairmen stationed on Earth.  Part of a massive operation to extract vital resources after decades of war wi.... Budget: $120M, Revenue: $286M, Rating: 6.4/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/75612",
      "title": "Oblivion",
      "genres": [
        "Action",
        "Adventure",
        "Mystery",
        "ScienceFiction"
      ],
      "plot": "Jack Harper is one of the last few drone repairmen stationed on Earth.  Part of a massive operation to extract vital resources after decades of war with a terrifying threat known as the Scavs, Jack’s mission is nearly complete.  His existence is brought crashing down when he rescues a beautiful  stranger from a downed spacecraft.  Her arrival triggers a chain of events that  forces him to question everything he knows and puts the fate of humanity in his hands.",
      "budget": 120000000.0,
      "release_date": "2013-04-10",
      "rating": 6.4,
      "revenue": 286168572.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_175",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Now You See Me",
    "text": "Now You See Me (2013). is a Crime, Thriller movie. Plot: An FBI agent and an Interpol detective track a team of illusionists who pull off bank heists during their performances and reward their audiences with.... Budget: $75M, Revenue: $118M, Rating: 7.3/10. Part of Now You See Me Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/75656",
      "title": "Now You See Me",
      "genres": [
        "Crime",
        "Thriller"
      ],
      "plot": "An FBI agent and an Interpol detective track a team of illusionists who pull off bank heists during their performances and reward their audiences with the money.",
      "budget": 75000000.0,
      "release_date": "2013-05-29",
      "rating": 7.3,
      "revenue": 117698894.0,
      "cast": [],
      "collection": "Now You See Me Collection"
    }
  },
  {
    "id": "entity_movie_176",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Wolverine",
    "text": "The Wolverine (2013). is a Action, Adventure, Fantasy movie. Plot: Wolverine faces his ultimate nemesis - and tests of his physical, emotional, and mortal limits - in a life-changing voyage to modern-day Japan..... Budget: $120M, Revenue: $415M, Rating: 6.3/10. Part of The Wolverine Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/76170",
      "title": "The Wolverine",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "ScienceFiction"
      ],
      "plot": "Wolverine faces his ultimate nemesis - and tests of his physical, emotional, and mortal limits - in a life-changing voyage to modern-day Japan.",
      "budget": 120000000.0,
      "release_date": "2013-07-23",
      "rating": 6.3,
      "revenue": 415440673.0,
      "cast": [],
      "collection": "The Wolverine Collection"
    }
  },
  {
    "id": "entity_movie_177",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Thor: The Dark World",
    "text": "Thor: The Dark World (2013). is a Action, Adventure, Fantasy movie. Plot: Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Fa.... Budget: $170M, Revenue: $645M, Rating: 6.8/10. Part of Thor Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/76338",
      "title": "Thor: The Dark World",
      "genres": [
        "Action",
        "Adventure",
        "Fantasy"
      ],
      "plot": "Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.",
      "budget": 170000000.0,
      "release_date": "2013-10-29",
      "rating": 6.8,
      "revenue": 644571402.0,
      "cast": [],
      "collection": "Thor Collection"
    }
  },
  {
    "id": "entity_movie_178",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Mad Max: Fury Road",
    "text": "Mad Max: Fury Road (2015). is a Action, Adventure, ScienceFiction movie. Plot: An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed figh.... Budget: $150M, Revenue: $379M, Rating: 7.3/10. Part of Mad Max Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/76341",
      "title": "Mad Max: Fury Road",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.",
      "budget": 150000000.0,
      "release_date": "2015-05-13",
      "rating": 7.3,
      "revenue": 378858340.0,
      "cast": [],
      "collection": "Mad Max Collection"
    }
  },
  {
    "id": "entity_movie_179",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Harry Potter and the Half-Blood Prince",
    "text": "Harry Potter and the Half-Blood Prince (2009). is a Adventure, Family, Fantasy movie. Plot: As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lor.... Budget: $250M, Revenue: $934M, Rating: 7.4/10. Part of Harry Potter Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/767",
      "title": "Harry Potter and the Half-Blood Prince",
      "genres": [
        "Adventure",
        "Family",
        "Fantasy"
      ],
      "plot": "As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past.",
      "budget": 250000000.0,
      "release_date": "2009-07-07",
      "rating": 7.4,
      "revenue": 933959197.0,
      "cast": [],
      "collection": "Harry Potter Collection"
    }
  },
  {
    "id": "entity_movie_180",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Memento",
    "text": "Memento (2000). is a Mystery, Thriller movie. Plot: Suffering short-term memory loss after a head injury, Leonard Shelby embarks on a grim quest to find the lowlife who murdered his wife in this gritty,.... Budget: $9M, Revenue: $40M, Rating: 8.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/77",
      "title": "Memento",
      "genres": [
        "Mystery",
        "Thriller"
      ],
      "plot": "Suffering short-term memory loss after a head injury, Leonard Shelby embarks on a grim quest to find the lowlife who murdered his wife in this gritty, complex thriller that packs more knots than a hangman's noose. To carry out his plan, Shelby snaps Polaroids of people and places, jotting down contextual notes on the backs of photos to aid in his search and jog his memory. He even tattoos his own body in a desperate bid to remember.",
      "budget": 9000000.0,
      "release_date": "2000-10-11",
      "rating": 8.1,
      "revenue": 39723096.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_181",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Intouchables",
    "text": "The Intouchables (2011). is a Comedy, Drama movie. Plot: A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the proje.... Budget: $13M, Revenue: $426M, Rating: 8.2/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/77338",
      "title": "The Intouchables",
      "genres": [
        "Comedy",
        "Drama"
      ],
      "plot": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects.",
      "budget": 13000000.0,
      "release_date": "2011-11-02",
      "rating": 8.2,
      "revenue": 426480871.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_182",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Blade Runner",
    "text": "Blade Runner (1982). is a Drama, ScienceFiction, Thriller movie. Plot: In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have .... Budget: $28M, Revenue: $33M, Rating: 7.9/10. Part of Blade Runner Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/78",
      "title": "Blade Runner",
      "genres": [
        "Drama",
        "ScienceFiction",
        "Thriller"
      ],
      "plot": "In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.",
      "budget": 28000000.0,
      "release_date": "1982-06-25",
      "rating": 7.9,
      "revenue": 33139618.0,
      "cast": [],
      "collection": "Blade Runner Collection"
    }
  },
  {
    "id": "entity_movie_183",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Se7en",
    "text": "Se7en (1995). is a Crime, Mystery, Thriller movie. Plot: Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film t.... Budget: $33M, Revenue: $327M, Rating: 8.1/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/807",
      "title": "Se7en",
      "genres": [
        "Crime",
        "Mystery",
        "Thriller"
      ],
      "plot": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
      "budget": 33000000.0,
      "release_date": "1995-09-22",
      "rating": 8.1,
      "revenue": 327311859.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_184",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Shrek",
    "text": "Shrek (2001). is a Adventure, Animation, Comedy movie. Plot: It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the cl.... Budget: $60M, Revenue: $484M, Rating: 7.3/10. Part of Shrek Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/808",
      "title": "Shrek",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family",
        "Fantasy"
      ],
      "plot": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
      "budget": 60000000.0,
      "release_date": "2001-05-16",
      "rating": 7.3,
      "revenue": 484409218.0,
      "cast": [],
      "collection": "Shrek Collection"
    }
  },
  {
    "id": "entity_movie_185",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Wreck-It Ralph",
    "text": "Wreck-It Ralph (2012). is a Adventure, Animation, Comedy movie. Plot: Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings .... Budget: $165M, Revenue: $471M, Rating: 7.1/10. Part of Wreck-It Ralph Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/82690",
      "title": "Wreck-It Ralph",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
      "budget": 165000000.0,
      "release_date": "2012-11-01",
      "rating": 7.1,
      "revenue": 471222889.0,
      "cast": [],
      "collection": "Wreck-It Ralph Collection"
    }
  },
  {
    "id": "entity_movie_186",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Silver Linings Playbook",
    "text": "Silver Linings Playbook (2012). is a Comedy, Drama, Romance movie. Plot: After spending eight months in a mental institution, a former teacher moves back in with his parents and tries to reconcile with his ex-wife..... Budget: $21M, Revenue: $206M, Rating: 7.0/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/82693",
      "title": "Silver Linings Playbook",
      "genres": [
        "Comedy",
        "Drama",
        "Romance"
      ],
      "plot": "After spending eight months in a mental institution, a former teacher moves back in with his parents and tries to reconcile with his ex-wife.",
      "budget": 21000000.0,
      "release_date": "2012-09-08",
      "rating": 7.0,
      "revenue": 205738714.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_187",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Fast & Furious 6",
    "text": "Fast & Furious 6 (2013). is a Action, Crime, Thriller movie. Plot: Hobbs has Dominic and Brian reassemble their crew to take down a team of mercenaries: Dominic unexpectedly gets convoluted also facing his presumed de.... Budget: $160M, Revenue: $789M, Rating: 6.7/10. Part of The Fast and the Furious Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/82992",
      "title": "Fast & Furious 6",
      "genres": [
        "Action",
        "Crime",
        "Thriller"
      ],
      "plot": "Hobbs has Dominic and Brian reassemble their crew to take down a team of mercenaries: Dominic unexpectedly gets convoluted also facing his presumed deceased girlfriend, Letty.",
      "budget": 160000000.0,
      "release_date": "2013-05-06",
      "rating": 6.7,
      "revenue": 788679850.0,
      "cast": [],
      "collection": "The Fast and the Furious Collection"
    }
  },
  {
    "id": "entity_movie_188",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Raiders of the Lost Ark",
    "text": "Raiders of the Lost Ark (1981). is a Action, Adventure movie. Plot: When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legen.... Budget: $18M, Revenue: $390M, Rating: 7.7/10. Part of Indiana Jones Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/85",
      "title": "Raiders of the Lost Ark",
      "genres": [
        "Action",
        "Adventure"
      ],
      "plot": "When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.",
      "budget": 18000000.0,
      "release_date": "1981-06-12",
      "rating": 7.7,
      "revenue": 389925971.0,
      "cast": [],
      "collection": "Indiana Jones Collection"
    }
  },
  {
    "id": "entity_movie_189",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Saving Private Ryan",
    "text": "Saving Private Ryan (1998). is a Drama, History, War movie. Plot: As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain Joh.... Budget: $70M, Revenue: $482M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/857",
      "title": "Saving Private Ryan",
      "genres": [
        "Drama",
        "History",
        "War"
      ],
      "plot": "As U.S. troops storm the beaches of Normandy, three brothers lie dead on the battlefield, with a fourth trapped behind enemy lines. Ranger captain John Miller and seven men are tasked with penetrating German-held territory and bringing the boy home.",
      "budget": 70000000.0,
      "release_date": "1998-07-24",
      "rating": 7.9,
      "revenue": 481840909.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_190",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Lion King",
    "text": "The Lion King (1994). is a Animation, Drama, Family movie. Plot: A young lion cub named Simba can't wait to be king. But his uncle craves the title for himself and will stop at nothing to get it..... Budget: $45M, Revenue: $788M, Rating: 8.0/10. Part of The Lion King Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/8587",
      "title": "The Lion King",
      "genres": [
        "Animation",
        "Drama",
        "Family"
      ],
      "plot": "A young lion cub named Simba can't wait to be king. But his uncle craves the title for himself and will stop at nothing to get it.",
      "budget": 45000000.0,
      "release_date": "1994-06-23",
      "rating": 8.0,
      "revenue": 788241776.0,
      "cast": [],
      "collection": "The Lion King Collection"
    }
  },
  {
    "id": "entity_movie_191",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Toy Story",
    "text": "Toy Story (1995). is a Animation, Comedy, Family movie. Plot: Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's he.... Budget: $30M, Revenue: $374M, Rating: 7.7/10. Part of Toy Story Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/862",
      "title": "Toy Story",
      "genres": [
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
      "budget": 30000000.0,
      "release_date": "1995-10-30",
      "rating": 7.7,
      "revenue": 373554033.0,
      "cast": [],
      "collection": "Toy Story Collection"
    }
  },
  {
    "id": "entity_movie_192",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Toy Story 2",
    "text": "Toy Story 2 (1999). is a Animation, Comedy, Family movie. Plot: Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, .... Budget: $90M, Revenue: $497M, Rating: 7.3/10. Part of Toy Story Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/863",
      "title": "Toy Story 2",
      "genres": [
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
      "budget": 90000000.0,
      "release_date": "1999-10-30",
      "rating": 7.3,
      "revenue": 497366869.0,
      "cast": [],
      "collection": "Toy Story Collection"
    }
  },
  {
    "id": "entity_movie_193",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Taken",
    "text": "Taken (2008). is a Action, Thriller movie. Plot: While vacationing with a friend in Paris, an American girl is kidnapped by a gang of human traffickers intent on selling her into forced prostitution..... Budget: $25M, Revenue: $227M, Rating: 7.2/10. Part of Taken Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/8681",
      "title": "Taken",
      "genres": [
        "Action",
        "Thriller"
      ],
      "plot": "While vacationing with a friend in Paris, an American girl is kidnapped by a gang of human traffickers intent on selling her into forced prostitution. Working against the clock, her ex-spy father must pull out all the stops to save her. But with his best years possibly behind him, the job may be more than he can handle.",
      "budget": 25000000.0,
      "release_date": "2008-02-18",
      "rating": 7.2,
      "revenue": 226830568.0,
      "cast": [],
      "collection": "Taken Collection"
    }
  },
  {
    "id": "entity_movie_194",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Life of Pi",
    "text": "Life of Pi (2012). is a Action, Adventure, Drama movie. Plot: The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipw.... Budget: $120M, Revenue: $609M, Rating: 7.2/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/87827",
      "title": "Life of Pi",
      "genres": [
        "Action",
        "Adventure",
        "Drama"
      ],
      "plot": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.",
      "budget": 120000000.0,
      "release_date": "2012-11-20",
      "rating": 7.2,
      "revenue": 609016565.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_195",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Cars",
    "text": "Cars (2006). is a Adventure, Animation, Comedy movie. Plot: Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself u.... Budget: $120M, Revenue: $462M, Rating: 6.6/10. Part of Cars Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/920",
      "title": "Cars",
      "genres": [
        "Adventure",
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
      "budget": 120000000.0,
      "release_date": "2006-06-08",
      "rating": 6.6,
      "revenue": 461983149.0,
      "cast": [],
      "collection": "Cars Collection"
    }
  },
  {
    "id": "entity_movie_196",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Despicable Me 2",
    "text": "Despicable Me 2 (2013). is a Animation, Comedy, Family movie. Plot: Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal..... Budget: $76M, Revenue: $971M, Rating: 7.0/10. Part of Despicable Me Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/93456",
      "title": "Despicable Me 2",
      "genres": [
        "Animation",
        "Comedy",
        "Family"
      ],
      "plot": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal.",
      "budget": 76000000.0,
      "release_date": "2013-06-25",
      "rating": 7.0,
      "revenue": 970761885.0,
      "cast": [],
      "collection": "Despicable Me Collection"
    }
  },
  {
    "id": "entity_movie_197",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Gladiator",
    "text": "Gladiator (2000). is a Action, Adventure, Drama movie. Plot: In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos. Maximus is one of the Roman army's most capable and trusted .... Budget: $103M, Revenue: $458M, Rating: 7.9/10.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/98",
      "title": "Gladiator",
      "genres": [
        "Action",
        "Adventure",
        "Drama"
      ],
      "plot": "In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos. Maximus is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences. His battle skills serve him well, and he becomes one of the most famous and admired men to fight in the Colosseum. Determined to avenge himself against the man who took away his freedom and laid waste to his family, Maximus believes that he can use his fame and skill in the ring to avenge the loss of his family and former glory. As the gladiator begins to challenge his rule, Commodus decides to put his own fighting mettle to the test by squaring off with Maximus in a battle to the death.",
      "budget": 103000000.0,
      "release_date": "2000-05-01",
      "rating": 7.9,
      "revenue": 457640427.0,
      "cast": []
    }
  },
  {
    "id": "entity_movie_198",
    "type": "entity",
    "entity_type": "Movie",
    "title": "The Incredibles",
    "text": "The Incredibles (2004). is a Action, Adventure, Animation movie. Plot: Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbi.... Budget: $92M, Revenue: $631M, Rating: 7.4/10. Part of The Incredibles Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/9806",
      "title": "The Incredibles",
      "genres": [
        "Action",
        "Adventure",
        "Animation",
        "Family"
      ],
      "plot": "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
      "budget": 92000000.0,
      "release_date": "2004-11-05",
      "rating": 7.4,
      "revenue": 631442092.0,
      "cast": [],
      "collection": "The Incredibles Collection"
    }
  },
  {
    "id": "entity_movie_199",
    "type": "entity",
    "entity_type": "Movie",
    "title": "Avengers: Age of Ultron",
    "text": "Avengers: Age of Ultron (2015). is a Action, Adventure, ScienceFiction movie. Plot: When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fat.... Budget: $280M, Revenue: $1405M, Rating: 7.3/10. Part of The Avengers Collection collection.",
    "metadata": {
      "uri": "http://saraaymericradhi.org/movie/99861",
      "title": "Avengers: Age of Ultron",
      "genres": [
        "Action",
        "Adventure",
        "ScienceFiction"
      ],
      "plot": "When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.",
      "budget": 280000000.0,
      "release_date": "2015-04-22",
      "rating": 7.3,
      "revenue": 1405403694.0,
      "cast": [],
      "collection": "The Avengers Collection"
    }
  }
]